{"200401": {"c": "ANTH 326", "n": "Anthropology of the Body, Health and Illness", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Aslı Çarkoğlu", "ta": 9, "tc": 30}], "ce": 0, "p": 181}, "200701": {"c": "ANTH 326", "n": "Anthropology of the Body", "f": "FASS", "cr": 3.0, "ac": 36, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Ayşe Parla", "ta": 36, "tc": 40}], "ce": 1, "p": 85}, "201302": {"c": "ANTH 326", "n": "Anthropology of the Body", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 40, "pr": ["ANTH 526"], "co": [], "i": [{"tn": "Ayşe Parla", "ta": 4, "tc": 40}], "ce": 1, "p": 369}, "201701": {"c": "ANTH 326", "n": "Anthropology of the Body", "f": "FASS", "cr": 3.0, "ac": 44, "ca": 45, "pr": ["ANTH 526"], "co": [], "i": [{"tn": "Ayşecan Terzioğlu", "ta": 44, "tc": 45}], "ce": 1, "p": 130}, "201801": {"c": "ANTH 326", "n": "Anthropology of the Body", "f": "FASS", "cr": 3.0, "ac": 43, "ca": 46, "pr": ["ANTH 526"], "co": [], "i": [{"tn": "Ayşecan Terzioğlu", "ta": 43, "tc": 46}], "ce": 1, "p": 130}, "202001": {"c": "ANTH 326", "n": "Anthropology of the Body", "f": "FASS", "cr": 3.0, "ac": 31, "ca": 45, "pr": ["ANTH 526"], "co": [], "i": [{"tn": "Ayşe Gül Altınay", "ta": 31, "tc": 45}], "ce": 1, "p": 169}, "catList": ["This is a course about the cultural understandings of the body, the bodily experience of health and illness as well as cultural organization of medical systems we are all involved in everyday of our lives. The course adopts a cross-cultural perspective and aims to look at the relationships among illness, health, healing systems, the human body, and broader socio-political power systems. We will be looking at how our understanding of our bodies, the diseases, and our health, as well as our embodied practices (e.g. eating, exercise, self-grooming etc.) are shaped by the socio-cultural contexts we live in, and by the cultural meanings that are created to make sense of them. We will also discuss the effects of globalization, specifically of the spread of Western biomedical ideas on local perceptions and understandings of health and illness. These arguments will push us to think about the ways that different cultural systems come up against one another in terms of approaches to disease, reproduction, sexuality, and bodily processes, issues which involve questions about power and meaning.", "The biological body has an undeniable physicality, yet at the same time, our experiences of our bodies and the ways in which we make sense of those experiences are inevitably embedded in and defined by the social. Taking an anthropological perspective and paying attention to both discursive and phenomenological approaches, this introductory course will investigate the ways in which the body has been observed, classified, experienced and modified in different cultural contexts and disciplinary regimes."]}