{"200701": {"c": "HIST 493", "n": "Caucasus and its Hinterland: Clans, Ethnicities and Nations in Imperial Borderlands", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Fikret Adanır", "ta": 6, "tc": 25}], "ce": 0, "p": 305}, "200902": {"c": "HIST 493", "n": "Caucasus and its Hinterland: Clans, Ethnicities and Nations in Imperial Borderlands", "f": "FASS", "cr": 3.0, "ac": 12, "ca": 15, "pr": ["HIST 593"], "co": [], "i": [{"tn": "Fikret Adanır", "ta": 12, "tc": 15}], "ce": 0, "p": 214}, "catList": ["The Caucasus and its hinterland, which separate as well as connect the Pontic, the Caspian, and the Persian Gulf basins, have been a strategically important and therefore contested space since antiquity. In modern times, the region was at first fought over by the rival Muslim empires of the Ottomans and the Safavids. The entry of imperial Russia into the arena in the last decades of the eighteenth century ushered in the era of Christian predominance. The next century saw the penetration of the whole Muslim Middle East by western economic interests, accompanied by new conflicts and alignments both on intraregional and international levels. Whereas the evolution of the so-called Eastern Question that implied the settlement of the Ottoman succession parallel to Russian expansion into Transcaucasia encouraged the Christian populations of the region (the Georgians, the Armenians) to aspire to self-rule and even independence, the Muslims felt humiliated and feared a degradation of their traditional ways of life. Their reaction, beginning with the mountaineers' resistance to Russian colonization of the north Caucasus in the last decades of the eighteenth century and reaching its apex under the leadership of Imam Shamil (1834-1859), exacerbated by forced migrations of the Circassians and other Caucasian groups into Anatolia, entailed in the long run ethnic and religious violence in various forms, directed against both the neighbouring groups and the imperial centres. This development culminated in mass deportations and genocidal events during the two world wars of the twentieth century, ethnic conflict, nationalist secessionism and imperialist rivalries breaking out with new vigour in the post-Sovie era. The course will approach this complex history from the vantage point of the concept of \"zones of violence\", studying and discussing thereby the catastrophic experiences of the period within a multicausal framework"]}