{"199901": {"c": "HIST 611", "n": "Readings in Ottoman Material Culture", "f": "FASS", "cr": 3.0, "ac": 2, "ca": 6, "pr": [], "co": [], "i": [{"tn": "Tülay Artan", "ta": 2, "tc": 6}], "ce": 0, "p": 25}, "200401": {"c": "HIST 611", "n": "Readings in Ottoman Material Culture", "f": "FASS", "cr": 3.0, "ac": 1, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Tülay Artan", "ta": 1, "tc": 5}], "ce": 1, "p": 297}, "201102": {"c": "HIST 611", "n": "Readings in Ottoman Material Culture", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 16, "pr": [], "co": [], "i": [{"tn": "Tülay Artan", "ta": 3, "tc": 16}], "ce": 2, "p": 394}, "201302": {"c": "HIST 611", "n": "Readings in Ottoman Material Culture", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Tülay Artan", "ta": 4, "tc": 10}], "ce": 2, "p": 369}, "201501": {"c": "HIST 611", "n": "Readings in Ottoman Material Culture", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 16, "pr": [], "co": [], "i": [{"tn": "Tülay Artan", "ta": 6, "tc": 16}], "ce": 2, "p": 381}, "catList": ["", "The aim of this course is twofold. The first is to study the history of material culture in the Ottoman realm as a kind of alternative perspective in social history. To some extent, such perspectives are linked to the ongoing anthropologization of history. Second, since individuals (men and women, young and old, rich and poor) as well as the material world that surrounded them, have been largely neglected in Ottoman historical studies and this seems to be related to the fact that the primary sources that researchers have most readily made use of have been mainly official papers of the state, HIST 611 will deliberately be exploring and studying other types of documents that may shed light on this neglected domain. The idea here is to develop a more qualitative understanding of elite or ordinary life, both by investigating the material circumstances of daily existence, and by entering the inner world of the family and household, the work-place, the neighbourhood - contexts normally assigned to the domain of culture. Also included, ideally, will be housing and homelessness, clothing and nakedness, eating and hunger. A special effort will be made to establish links with equally recent developments in (1) the history of everyday life; (2) family history and the history of kinship; (3) gender history; (4) standards of living; and (5) consumption studies. Requirements : a major research paper of around 30 pages based on primary source materials. Counts towards fulfilling the seminar requirement in History while also serving as a course in advanced paleography. Prerequisite : An adequate command of Ottoman Turkish, subject to the instructor's approval.", "The aim of this course is twofold. The first is to study the history of material culture in the Ottoman realm as a kind of alternative perspective in social history. To some extent, such perspectives are linked to the ongoing anthropologization of history. Second, since individuals (men and women, young and old, rich and poor) as well as the material world that surrounded them, have been largely neglected in Ottoman historical studies and this seems to be related to the fact that the primary sources that researchers have most readily made use of have been mainly official papers of the state, HIST 611 will deliberately be exploring and studying other types of documents and evidence that may shed light on this neglected domain. The idea here is to develop a more qualitative understanding of elite or ordinary life, both by investigating the material circumstances of daily existence, and by entering the inner world of the family and household, the work-place, the neighbourhood -- contexts normally assigned to the domain of culture. Also included, ideally, will be housing and homelessness, clothing and nakedness, eating and hunger. A special effort will be made to establish links with equally recent developments in (1) the history of everyday life; (2) family history and the history of kinship; (3) gender history; (4) standards of living; and (5) consumption studies. Requirements : a major research paper of around 30 pages based on primary source materials. Counts towards fulfilling the seminar requirement in History while also serving as a course in advanced paleography. Prerequisite : An adequate command of Ottoman Turkish, through TLL 501-502 or the equivalent, and subject to the instructor's approval."]}