{"200302": {"c": "HIST 431", "n": "Introduction to Byzantine History (AD 300-1453)", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Tijana Krstic", "ta": 3, "tc": 15}], "ce": 0, "p": 254}, "200501": {"c": "HIST 431", "n": "Introduction to Byzantine History (AD 300-1453)", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Maria Vaiou", "ta": 3, "tc": 20}], "ce": 0, "p": 307}, "200703": {"c": "HIST 431", "n": "Introduction to Byzantine History (AD 300-1453)", "f": "FASS", "cr": 3.0, "ac": 25, "ca": 25, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Koray Şevki Durak", "ta": 25, "tc": 25}], "ce": 1, "p": 22}, "200803": {"c": "HIST 431", "n": "Introduction to Byzantine History (AD 300-1453)", "f": "FASS", "cr": 3.0, "ac": 10, "ca": 40, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Koray Şevki Durak", "ta": 10, "tc": 40}], "ce": 1, "p": 48}, "201003": {"c": "HIST 431", "n": "Introduction to Byzantine History (AD 300-1453)", "f": "FASS", "cr": 3.0, "ac": 10, "ca": 20, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Savvas Kyriakidis", "ta": 10, "tc": 20}], "ce": 1, "p": 59}, "catList": ["The course is an introduction to the society, politics, and culture of Byzantium.  It covers the transformation of the Late Roman through the East Roman into the Byzantine empire, the role of the Byzantine church, the changing political, military, and economic fortunes of the empire over the centuries, as well as the everyday life of various social groups (including peasants, soldiers, monks, artisans, and women). Byzantium will be treated not in isolation, but in a broader world-context comprising its neighbors and political rivals, and focusing especially on its relations with the Papacy and the Holy Roman Empire, the Balkan Slavs, and contemporary Muslim powers.  Readings will include a variety of printed primary sources in translation together with selections from the standard secondary literature.", "This course is an introduction to the society, politics, and culture of Byzantium. It covers the transformation of the Late Roman through the East Roman into the Byzantine empire, the role of the Byzantine church, the changing political, military, and economic fortunes of the empire over the centuries, as well as the everyday life of various social groups (including peasants, soldiers, monks, artisans, and women). Byzantium will be treated not in isolation, but in a broader world-context comprising its neighbors and political rivals, and focusing especially on its relations with the Papacy and the Holy Roman Empire, the Balkan Slavs, and contemporary Muslim powers. Readings will include a variety of printed primary sources  in translation together with selections from the standard secondary literature."]}