{"200101": {"c": "HIST 647", "n": "History of Political Ideas in the Balkans in the Balkans in 19th and 20th cc.", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Diana Mishkova", "ta": 3, "tc": 10}], "ce": 0, "p": 148}, "catList": ["Capable of being taken both as a \"companion\" to HIST 549 and also on its own, HIST 547/647 represents a departure in some measure from that of a classical \"history of ideas\" course. It is concentrated less on the study of political ideas as theoretical/intellectual constructions per se, than on their contextualization, therefore on the explanation of their specific local articulations and varying social weight. This shift in focus follows from two general contextual premises : (a) The disproportionate significance of the political in the changing Balkan societies in the modern era; and (b) the ideological systems within and by way of which local national elites have pursued their developmental policies. Hence a primary concern will be not to gauge how faithfully a certain \"Balkan\" political development has corresponded to its \"European\" prototype, but rather to see what functions and hopes were pinned on it; how efficient it was in terms of imposing (new) norms of political action and of social and economic relations; and finally, what the sources of intra-Balkan diversity have been in all these regards. All major politico-ideological (self-) definitions of the 19th and 20th centuries, as well as their mutual relations/influences, will be considered. The implicit objective will be to shed light on the historically crystallized semantics of the modern political vocabulary in the Balkans - of terms like \"tradition\", \"modernity\", \"freedom\", \"the people\", \"democracy\", \"nation\", \"parliamentarianism\", and \"political participation\". May be taken both as a a taught course and as a seminar, subject to the approval of the instructor and the fulfillment of the research paper requirements for a seminar in History."]}