{"200501": {"c": "MAT 524", "n": "Synthesis", "f": "FENS", "cr": 3.0, "ac": 2, "ca": 10, "pr": [], "co": ["MAT 524D", "MAT 524R"], "i": [{"tn": "Alpay Taralp", "ta": 2, "tc": 10}], "ce": 0, "p": 324}, "201201": {"c": "MAT 524", "n": "Synthesis", "f": "FENS", "cr": 3.0, "ac": 21, "ca": 21, "pr": [], "co": [], "i": [{"tn": "Alpay Taralp", "ta": 21, "tc": 21}], "ce": 0, "p": 146}, "201301": {"c": "MAT 524", "n": "Synthesis", "f": "FENS", "cr": 3.0, "ac": 7, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Alpay Taralp", "ta": 7, "tc": 20}], "ce": 0, "p": 354}, "201401": {"c": "MAT 524", "n": "Synthesis", "f": "FENS", "cr": 3.0, "ac": 14, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Alpay Taralp", "ta": 14, "tc": 15}], "ce": 0, "p": 245}, "201502": {"c": "MAT 524", "n": "Synthesis", "f": "FENS", "cr": 3.0, "ac": 22, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Selmiye Alkan Gürsel", "ta": 22, "tc": 25}], "ce": 0, "p": 173}, "catList": ["This practical course emphasizes the origins of bonding, the different models used to rationalize bonding, and the reaction mechanisms by which organic and inorganic transformations are realized. Describing possibly the more fundamental of knowledge bases, enrollees of this course will envisage, design and potentially synthesize compounds and materials. Background information of syntheses will be provided, followed with biweekly assignments related to synthesis. Students will be rigorously encouraged to develop practical approaches, problem-solving skills, and insight into hypothetical situations that warrant a researcher's viewpoint. Apart from the practical aspects, the scientific method and concepts of experimental design will be central themes. Most importantly, attendants of the course can apply this knowledge base totheir graduate research: Safety tips; proper use of equipment and traps; organic synthesis; organometallic synthesis; aqueous phase synthesis; enzymatic synthesis; solvent-free synthesis; inorganic synthesis via sol-gel technology; basics and tricks."]}