{"200501": {"c": "ITM 501", "n": "Data Analysis", "f": "SOM", "cr": 1.5, "ac": 8, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Enes Eryarsoy", "ta": 8, "tc": 12}], "ce": 0, "p": 222}, "200601": {"c": "ITM 501", "n": "Data Analysis", "f": "SOM", "cr": 1.5, "ac": 11, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Enes Eryarsoy", "ta": 11, "tc": 25}], "ce": 0, "p": 206}, "200701": {"c": "ITM 501", "n": "Data Analysis", "f": "SOM", "cr": 1.5, "ac": 12, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Enes Eryarsoy", "ta": 12, "tc": 20}], "ce": 0, "p": 197}, "200801": {"c": "ITM 501", "n": "Business Simulation & Analysis", "f": "SOM", "cr": 3.0, "ac": 7, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Fatma Tevhide Altekin", "ta": 7, "tc": 20}], "ce": 1, "p": 286}, "catList": ["This course provides an introduction to concepts and applications in probability and statistics that will provide basis for other courses in the program. The topics covered include data collection, summarizing and describing data, visualizing data, descriptive measures of data, relationship between two or more sets of related data, measuring uncertainty, random variables and probability distributions, statistical concepts such as sampling distributions, confidence intervals and hypothesis testing, analysis of variance and regression.", "The objective of this course is to use simulation to facilitate decision making in an uncertain business environment. Making good decisions requires the availability of business-critical knowledge when you need it. As the path from crude data to managerial knowledge requires the application of business statistics, the first part of the course involves techniques for collecting data; summarizing, describing and visualizing data; analysis of variance and regression. The second part of the course covers discrete-event simulation concepts and tools for decision making under uncertainty. While an emphasis will be given on the implementation of simulation within the context of ITM, the studied topics include simulation modeling, verification and validation, and input and output analysis that require further statistical concepts."]}