{"201302": {"c": "ETM 502", "n": "Environment, Climate Change and Social Cost", "f": "FENS", "cr": 3.0, "ac": 11, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Melsa Ararat", "ta": 11, "tc": 25}], "ce": 0, "p": 233}, "201402": {"c": "ETM 502", "n": "Environment, Climate Change and Social Cost", "f": "FENS", "cr": 3.0, "ac": 25, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Aslı Ganime Sezer Özçelik", "ta": 25, "tc": 30}], "ce": 0, "p": 135}, "201801": {"c": "ETM 502", "n": "Environment, Climate Change and Social Cost", "f": "FENS", "cr": 1.5, "ac": 14, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Ümit Şahin", "ta": 14, "tc": 30}], "ce": 1, "p": 262}, "202001": {"c": "ETM 502", "n": "Environment, Climate Change and Social Cost", "f": "FENS", "cr": 1.5, "ac": 16, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Ümit Şahin", "ta": 16, "tc": 30}], "ce": 1, "p": 266}, "catList": ["According to the UN, climate change is the defining issue of our era. Climate change underpins fundamental changes in the relationship between the businesses, society and the governments. The notion of sustainable development provides the normative framework for reconciling economic growth with social goals.  This module aims to help executives to comprehend this backdrop against which energy technologies and energy management evolves. At the end of the module, the participants should be able to understand the social cost of energy projects, the importance of energy efficiency and the  social and environmental impact of energy production as well as  the regulatory framework and the trends in international and local regulations. There will be a special emphasis on financing energy projects and financing instruments.", "What is anthropocene and how do the human impact on the planet and ecosystems evolve? Science and policy aspects of environmental problems and climate change; post-normal science; ways of consensus in the scientific community; climate change denial campaigns. Basics of climate science and impacts of climate change. Climate policies, mitigation, risk reduction and adaptation. Carbon budget, low-carbon energy transition and decarbonization of the energy systems. International climate politics. Energy efficiency, renewables and transformation of the energy policies in the wake of global climate change. Air pollution, water scarcity and sustainability of the energy systems."]}