{"200302": {"c": "BIO 676", "n": "Metal Homeostasis in Mammalian and Plant Systems", "f": "FENS", "cr": 3.0, "ac": 5, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Zehra Sayers", "ta": 5, "tc": 15}], "ce": 0, "p": 220}, "200402": {"c": "BIO 676", "n": "Metal Homeostasis in Mammalian and Plant Systems", "f": "FENS", "cr": 3.0, "ac": 3, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Zehra Sayers", "ta": 3, "tc": 15}], "ce": 0, "p": 275}, "200502": {"c": "BIO 676", "n": "Metal Homeostasis in Mammalian and Plant Systems", "f": "FENS", "cr": 3.0, "ac": 3, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Zehra Sayers", "ta": 3, "tc": 15}], "ce": 0, "p": 309}, "200602": {"c": "BIO 676", "n": "Metal Homeostasis in Mammalian and Plant Systems", "f": "FENS", "cr": 3.0, "ac": 5, "ca": 15, "pr": [], "co": [], "i": [{"tn": "İsmail Çakmak", "ta": 5, "tc": 15}], "ce": 0, "p": 296}, "200902": {"c": "BIO 676", "n": "Metal Homeostasis in Mammalian and Plant Systems", "f": "FENS", "cr": 3.0, "ac": 6, "ca": 15, "pr": [], "co": [], "i": [{"tn": "İsmail Çakmak", "ta": 6, "tc": 15}], "ce": 0, "p": 314}, "201702": {"c": "BIO 676", "n": "Metal Homeostasis in Plant Systems", "f": "FENS", "cr": 3.0, "ac": 4, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Ümit Barış Kutman", "ta": 4, "tc": 10}], "ce": 1, "p": 429}, "201802": {"c": "BIO 676", "n": "Metal Homeostasis in Plant Systems", "f": "FENS", "cr": 3.0, "ac": 5, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Ümit Barış Kutman", "ta": 5, "tc": 30}], "ce": 1, "p": 409}, "catList": ["Metal homeostasis plays an important role in the normal functioning of biological systems. Metals such as Zn, Fe and Cu are essential as co-actors for enzymatic activity and are involved protein folding and protein-protein, protein-DNA interactions. Biological systems have developed mechanisms to maintain the required levels of essential metal elements as well as those for detoxification and protection when the metal levels get too high. This course will focus on the physiological and molecular mechanisms of metal homeostasis and highlight the proteins and polypeptides involved in binding, transporting and sequestering metals in living systems. Biochemical, structural and functional features of these proteins will be studied. Effects of deficient levels of essential metals on crop production and human health will be discussed by giving examples from developing countries. Adverse effects of metal pollution on plants and introduction of heavy metals to humans through anti-cancer anti-inflammatory drugs will be discussed.", "Metal homeostasis plays a critical role in all kingdoms of life including plants. This course will start with an overview of metals in plant systems and an introduction to concepts related to molecular and cellular mechanisms of metal homeostasis. The focus of the first half of the course will then be on the physiological and biochemical functions of essential metallic nutrients in plants and plant responses to their deficiencies including tolerance mechanisms. The second part of the course will begin with a discussion of Al and heavy metals toxicities (Cd, Fe, Mn, Cu, Ni etc.) and focus on the relevant tolerance and detoxification mechanisms. Metalloids in plant systems, soil and environmental parameters affecting metal homeostasis, metal hyperaccumulation and phytoremediation will also be covered. Finally, the discussion will focus on the biofortification of food crops with micronutrients (Zn, Fe, Se etc.) and the connection between metal homeostasis in plants and human nutrition."]}