{"201501": {"c": "NS 213", "n": "Basic Concepts of Physics for Scientists and Engineers", "f": "FENS", "cr": 3.0, "ac": 49, "ca": 60, "pr": ["NS 102"], "co": [], "i": [{"tn": "Mehmet Ali Alpar", "ta": 49, "tc": 60}], "ce": 0, "p": 96}, "201601": {"c": "NS 213", "n": "Basic Concepts of Physics for Scientists and Engineers", "f": "FENS", "cr": 3.0, "ac": 92, "ca": 96, "pr": ["NS 102"], "co": [], "i": [{"tn": "Mehmet Ali Alpar", "ta": 92, "tc": 96}], "ce": 0, "p": 60}, "201701": {"c": "NS 213", "n": "Basic Concepts of Physics for Scientists and Engineers", "f": "FENS", "cr": 3.0, "ac": 18, "ca": 95, "pr": ["NS 102"], "co": [], "i": [{"tn": "Mehmet Zafer Gedik", "ta": 18, "tc": 95}], "ce": 0, "p": 224}, "201801": {"c": "NS 213", "n": "Basic Concepts of Physics for Scientists and Engineers", "f": "FENS", "cr": 3.0, "ac": 37, "ca": 60, "pr": ["NS 102"], "co": [], "i": [{"tn": "Mehmet Ali Alpar", "ta": 37, "tc": 60}], "ce": 0, "p": 147}, "201901": {"c": "NS 213", "n": "Basic Concepts of Physics for Scientists and Engineers", "f": "FENS", "cr": 3.0, "ac": 48, "ca": 60, "pr": ["NS 102"], "co": [], "i": [{"tn": "Mehmet Ali Alpar", "ta": 48, "tc": 60}], "ce": 0, "p": 111}, "202001": {"c": "NS 213", "n": "Basic Concepts of Physics for Scientists and Engineers", "f": "FENS", "cr": 3.0, "ac": 29, "ca": 60, "pr": ["NS 102"], "co": [], "i": [{"tn": "Mehmet Ali Alpar", "ta": 29, "tc": 60}], "ce": 0, "p": 180}, "catList": ["Observing and understanding the workings of nature and expressing this understanding in models and mathematical language is fundamental to the study of science and technology. This course introduces the basic concepts of physics and the methods of modeling and solving problems in science. The subjects to be covered are (mathematical content is noted in parantheses):  1. Mechanics: Newton's Laws of Motion. Energy Momentum and Angular Momentum. The Kepler problem. The study of systems near stable equilibrium: harmonic oscillators. Periodic motion; (the sinusoidal functions). Exponential damping and growth (the exponential function).  2. Statistical physics: The ideal gas law derived from mechanics. Meaning of temperature and pressure. Boltzmann definition of entropy based on the number of possible states (probability), with one simple example, the partitioning of a gas of N molecules into two half volumes: In a macroscopic system (large N), the most parobable situation is much much much more porbable than anything else-  the 2nd Law of Thermodynamics.  3. Electromagnetism. Electric and magnetic fields. The concepts of flux and circulation. Maxwell’s Equations and applications in the simplest geometry of two parallel plates (simple line and surface integrals). Electromagnetic wave propagation (the wave equation). 4. Quantum Physics. The Bohr model of the atom. Wave-particle duality and the Uncertainty Relation are needed to understand the properties of matter: What determines the size and structure of an atom? Relation between wavelength and system size. Why is there a Periodic Table?: The Pauli Principle."]}