{"199901": {"c": "GSM 509", "n": "Meaning Management", "f": "SOM", "cr": 3.0, "ac": 34, "ca": 50, "pr": [], "co": [], "i": [{"tn": "Fazıl Ahmet Öncü", "ta": 34, "tc": 50}], "ce": 0, "p": 12}, "200001": {"c": "GSM 509", "n": "Meaning Management", "f": "SOM", "cr": 3.0, "ac": 34, "ca": 50, "pr": [], "co": [], "i": [{"tn": "Muhittin Oral", "ta": 34, "tc": 50}], "ce": 0, "p": 17}, "200101": {"c": "GSM 509", "n": "Meaning Management", "f": "SOM", "cr": 3.0, "ac": 40, "ca": 45, "pr": [], "co": [], "i": [{"tn": "Fazıl Ahmet Öncü", "ta": 40, "tc": 45}], "ce": 0, "p": 24}, "200203": {"c": "GSM 509", "n": "Meaning Management", "f": "SOM", "cr": 3.0, "ac": 22, "ca": 22, "pr": [], "co": [], "i": [{"tn": "Muhittin Oral", "ta": 22, "tc": 22}], "ce": 1, "p": 7}, "200303": {"c": "GSM 509", "n": "Meaning Management", "f": "SOM", "cr": 3.0, "ac": 17, "ca": 17, "pr": [], "co": [], "i": [{"tn": "Fazıl Ahmet Öncü", "ta": 17, "tc": 17}], "ce": 1, "p": 21}, "catList": ["", "The main objective is to elaborate on the underlying types of managerial meaning construction which inform and direct organisational decision making and action (product, resource and value creation management) under conditions of contextual ambiguity (globalisation, competition, networking). These embody processes of interpreting and diagnosing the issues that arise from the dynamics of organisational context. Emphasis is on the enactment of the organisational environment by managers who, as part of their organisational role, are expected to make choices when they confront uncertainty. In addition to appreciating the existence of different stakeholders with competing values and interests as well as differential power sources within organisations, the subject also considers managers as negotiators in the bargaining between those groups. In this sense, managers occupy a central role in the construction of meaning through which organisational action is made possible. Other topics include the role of communication as mechanisms of securing and retaining control over the environment,and organisational culture and learning"]}