{"200603": {"c": "IT 566", "n": "IT Governance", "f": "FENS", "cr": 3.0, "ac": 21, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Mehmet Cüneyt Üvey", "ta": 21, "tc": 25}], "ce": 0, "p": 27}, "201503": {"c": "IT 566", "n": "IT Governance", "f": "FENS", "cr": 3.0, "ac": 13, "ca": 35, "pr": [], "co": [], "i": [{"tn": "Yasemin Turkan", "ta": 13, "tc": 35}], "ce": 0, "p": 75}, "201703": {"c": "IT 566", "n": "IT Governance", "f": "FENS", "cr": 3.0, "ac": 8, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 8, "tc": 30}], "ce": 0, "p": 68}, "201803": {"c": "IT 566", "n": "IT Governance", "f": "FENS", "cr": 3.0, "ac": 11, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 11, "tc": 40}], "ce": 0, "p": 60}, "201903": {"c": "IT 566", "n": "IT Governance", "f": "FENS", "cr": 3.0, "ac": 20, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Yasemin Turkan", "ta": 20, "tc": 40}], "ce": 0, "p": 56}, "catList": ["This course is designed to give students a broad Managerial Perspective; a CIO's or IT Manager's approach to an IT Organization. With a Quality based approach to an IT Organization first; then its resources, its processes and all the requirements expected from such an organization afterwards; the students will learn how to look at the IT Organization as a whole and how to place any IT Process to fit into the Organizational Structure. This will give the expertise and diagnosis of how and where each process takes place within the organization. The course also aims at equipping the student with Global Best Practices, IT Governance, Control and Security Standards, various methodologies and professional real-life know-how and experience. Another dimension of this course is to ensure that technical people are well equipped with social & managerial skills, which will add them value in understanding the world of business. Students will learn how Business-IT Alignment is to be achieved, how technical people should deal with business issues & how IT investments in an organization need to be controlled. At the completion of the course; the students are expected to have a unique understanding of control oriented business & technology partnership."]}