{"199902": {"c": "GSM 512", "n": "Practice Development II", "f": "SOM", "cr": 0.0, "ac": 34, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 34, "tc": 40}], "ce": 0, "p": 17}, "200002": {"c": "GSM 512", "n": "Practice Development II", "f": "SOM", "cr": 0.0, "ac": 17, "ca": 18, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 17, "tc": 18}], "ce": 0, "p": 29}, "200102": {"c": "GSM 512", "n": "Practice Development II", "f": "SOM", "cr": 0.0, "ac": 20, "ca": 21, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 20, "tc": 21}], "ce": 1, "p": 37}, "200202": {"c": "GSM 512", "n": "Practice Development II", "f": "SOM", "cr": 0.0, "ac": 13, "ca": 14, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 13, "tc": 14}], "ce": 1, "p": 102}, "200302": {"c": "GSM 512", "n": "Practice Development II", "f": "SOM", "cr": 0.0, "ac": 14, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 14, "tc": 15}], "ce": 1, "p": 109}, "catList": ["", "The objective of Practice Development II is to have participants develop the necessary frame for formulating, designing and negotiating project proposals with companies and organisations. It also aims at having the participants develop the necessary skills for effective project management.How to manage and how to fulfil the responsibilities both towards the client organisation and the MBA program are demonstrated through previously conducted actual real-life projects. Participants are required to develop their own project ideas working together with organisations and transform them into sponsored real-life project proposals. Therefore projects become the core discussion element in the second semester, for they are instrumental in developing the reflective component of action research and how one learns from practice. As such, the participants actively learn to construct their own personal experience through dialogue and as a part of their team within a real interaction. There will be an active matching process between the available projects, the desires of the participants to focus on certain projects and new projects to be offered by different companies. Finally, the practice development activity ends with a selection of projects for the second year that is consistent with the participants' future Executive goals."]}