{"200501": {"c": "HIST 434", "n": "Russian History I : Tsarist Russia (17th Century", "f": "FASS", "cr": 3.0, "ac": 7, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Selçuk Akşin Somel", "ta": 7, "tc": 20}], "ce": 0, "p": 240}, "201401": {"c": "HIST 434", "n": "Russian History I : Tsarist Russia (from the 17th Century to 1917)", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 10, "pr": ["HIST 534", "SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Jan Hennings", "ta": 9, "tc": 10}], "ce": 1, "p": 312}, "201501": {"c": "HIST 434", "n": "Russian History I : Tsarist Russia (from the 17th Century to 1917)", "f": "FASS", "cr": 3.0, "ac": 15, "ca": 19, "pr": ["HIST 534", "SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Jan Hennings", "ta": 15, "tc": 19}], "ce": 1, "p": 261}, "catList": ["This course begins with the rule of Tsar Alexei, the modernizing efforts of Peter the Great, and their socio-political effects. While elaborating the policies of \"enlightened reforms\" staged by Catherine the Great, Russian expansionism as well as popular reactions will be considered. Then the period between 1801 and 1855, marked by Napoleonic wars, autocratic conservatism and the Crimean War will be discussed. The following topics will be the emancipation of serfs and administrative reforms, expansion in Asia, and the emergence of revolutionary opposition. The turbulent period of 1890-1914 includes rapid industrialization, popular unrest, Russian defeat by Japan and the subsequent Revolution of 1905. Final weeks will concentrate on World War I events, and the revolutions of February and October 1917.", "This is a survey course on the general history of Russia from its early beginnings with the Muscovite state until World War I. It will begin with a general discussion on the geographical characteristics of Russia and the cultural peculiarities of the Russian population.  Here the emphasis will be on the Eurasian dimension or character of the Russian lands. Strictly historical lectures will begin with Muscovy over 1450-1598, and will continue into the ''Time of Troubles,'' leading to the rise of the Romanov dynasty.The next issue will be the modernizing efforts of Peter the Great, and the political and social effects of these Petrine reforms (1682-1740). In the course of reviewing the policies of  ''enlightened reform'' pursued by Catherine the Great (1762-1796), Russian expansionism against Poland and the Ottoman empire, as well as popular reactions such as the Pugachev Rebellion (1773-1775) will also be taken into account. Over the period between 1801-1855, the Napoleonic wars (1805-1815) and their impact, autocratic conservatism, and the Crimean War (1853-1856) will be highlighted. For the second half of the 19th century, attention fill focus on the emancipation of the serfs (1860), other administrative reforms and economic development accompanying expansion in Central Asia and Far East, and the emergence of a revolutionary opposition. The turbulent period of 1890-1914 will be discussed in terms of rapid industrialization, general poverty and popular unrest, defeat in the Russo-Japanese war and the subsequent 1905 revolution. The last weeks of the course will be devoted to World War I and the coming of the 1917 February and October revolutions."]}