{"200901": {"c": "PHYS 538", "n": "Phase Transitions and Renormalization-Group Theory", "f": "FENS", "cr": 3.0, "ac": 9, "ca": 52, "pr": [], "co": [], "i": [{"tn": "A. Nihat Berker", "ta": 9, "tc": 52}], "ce": 0, "p": 278}, "201001": {"c": "PHYS 538", "n": "Phase Transitions and Renormalization-Group Theory", "f": "FENS", "cr": 3.0, "ac": 5, "ca": 20, "pr": [], "co": ["PHYS 538R"], "i": [{"tn": "A. Nihat Berker", "ta": 5, "tc": 20}], "ce": 0, "p": 369}, "201102": {"c": "PHYS 538", "n": "Phase Transitions and Renormalization-Group Theory", "f": "FENS", "cr": 3.0, "ac": 2, "ca": 10, "pr": [], "co": ["PHYS 538R"], "i": [{"tn": "A. Nihat Berker", "ta": 2, "tc": 10}], "ce": 0, "p": 416}, "201202": {"c": "PHYS 538", "n": "Phase Transitions and Renormalization-Group Theory", "f": "FENS", "cr": 3.0, "ac": 2, "ca": 10, "pr": [], "co": ["PHYS 538R"], "i": [{"tn": "A. Nihat Berker", "ta": 2, "tc": 10}], "ce": 0, "p": 439}, "201501": {"c": "PHYS 538", "n": "Phase Transitions and Renormalization-Group Theory", "f": "FENS", "cr": 3.0, "ac": 3, "ca": 10, "pr": [], "co": ["PHYS 538R"], "i": [{"tn": "A. Nihat Berker", "ta": 3, "tc": 10}], "ce": 0, "p": 426}, "201601": {"c": "PHYS 538", "n": "Phase Transitions and Renormalization-Group Theory", "f": "FENS", "cr": 3.0, "ac": 2, "ca": 10, "pr": [], "co": ["PHYS 538R"], "i": [{"tn": "A. Nihat Berker", "ta": 2, "tc": 10}], "ce": 0, "p": 439}, "catList": ["The students will learn the remarkable phenomena occurring at phase transitions that are universally applicable to a wide range of systems, and simple and physically intuitive theory for deriving these phenomena. The dialog between experiment and theory, as well as the rich confluence of the intuitive, phenomenological, approximate, rigorous, and numerical approaches, will be illustrated: Introduction: phase diagrams, thermodynamic limit, critical phenomena, universality. Classical theories: naive mean-field, constructive mean-field, Landau theories; Ginzburg criterion. Ising models and exact results: one dimension; two dimensions; duality; global phase diagrams. Scaling theory of Kadanoff. Exact renormalization-group treatments in one dimension. Approximate renormalization-group treatments in two dimensions. Thermodynamic functions and first-order phase transitions. Momentum-space renormalization group: Gaussian model, Landau-Wilson model, epsilon-expansion. Variational renormalization group; Migdal-Kadanoff transformations. Hierarchical lattices. Dynamics: stochastic models; detailed balance; dynamic universality classes. Superfluidity. Blume-Emery-Griffiths model. Global multicritical phenomena. Surface systems. q-state Potts and Potts-lattice-gas models. Exact critical and tricritical exponents. Helicity and reentrance. Chaotic renormalization groups and spin-glass order. Order under frozen disorder and frustration. Scale-free and small-world networks. Connection between geometric and thermal properties. Neural networks, simulated annealing, coding-decoding, using phase transition models. Renormalization-group theory of quantum spin and electronic conduction models. High Tc superconductivity. Electron-exchange induced antiferromagnetism. Reverse impurity effects on antiferromagnetism and superconductivity."]}