{"200702": {"c": "ACC 401", "n": "Intermediate Financial Accounting and Reporting", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 30, "pr": ["MGMT 202"], "co": [], "i": [{"tn": "Hassanali Espahbodi", "ta": 6, "tc": 30}], "ce": 0, "p": 286}, "201102": {"c": "ACC 401", "n": "Intermediate Financial Accounting and Reporting", "f": "SOM", "cr": 3.0, "ac": 5, "ca": 30, "pr": ["ACC 201", "MGMT 202"], "co": [], "i": [{"tn": "Recep Pekdemir", "ta": 5, "tc": 30}], "ce": 0, "p": 335}, "201202": {"c": "ACC 401", "n": "Intermediate Financial Accounting and Reporting", "f": "SOM", "cr": 3.0, "ac": 5, "ca": 20, "pr": ["ACC 201", "MGMT 202"], "co": [], "i": [{"tn": "Meral Kiefer", "ta": 5, "tc": 20}], "ce": 0, "p": 362}, "201301": {"c": "ACC 401", "n": "Intermediate Financial Accounting and Reporting", "f": "SOM", "cr": 3.0, "ac": 20, "ca": 20, "pr": ["ACC 201", "MGMT 202"], "co": [], "i": [{"tn": "Recep Pekdemir", "ta": 20, "tc": 20}], "ce": 0, "p": 165}, "201801": {"c": "ACC 401", "n": "Intermediate Financial Accounting and Reporting", "f": "SOM", "cr": 3.0, "ac": 41, "ca": 50, "pr": ["ACC 201", "MGMT 202"], "co": [], "i": [{"tn": "Mine Hatice Aksu", "ta": 41, "tc": 50}], "ce": 0, "p": 135}, "201901": {"c": "ACC 401", "n": "Intermediate Financial Accounting and Reporting", "f": "SOM", "cr": 3.0, "ac": 23, "ca": 50, "pr": ["ACC 201", "MGMT 202"], "co": [], "i": [{"tn": "John Goodwin", "ta": 23, "tc": 50}], "ce": 1, "p": 212}, "catList": ["The purpose of this course is to enhance the students students' understanding of financial reporting and accounting practice through knowledge and skill refinement. The course is a continuation of the topics covered in MGMT 202- Introduction to Financial Accounting and Reporting. In its coverage of the topics, the limitations of the US and International accounting standards and the ethical dilemmas faced by the managers and accounting professionals are emphasized. Using cases and the annual reports of real life companies, the course goes into more advanced accounting topics such as: intangible assets, accounting for bond and stock issuance and stock options, contingencies, investments in debt and equity securities, earnings per share calculation, leases, pension plans, and inflation accounting, as time permits.", "The purpose of this course is to enhance students' understanding of financial reporting and accounting practice through knowledge and skill refinement. The course is a continuation of ACC 201 - Introduction to Financial Accounting and Reporting. Differences between the US and International accounting standards and the ethical dilemmas faced by the managers and accounting professionals are covered. Drawing on examples from the annual reports of real companies, the course goes into more advanced accounting topics such as: company income tax, non-current asset revaluations and impairments, accounting for long-term liabilities, and accounting for investments in debt and equity securities."]}