{"200402": {"c": "OPIM 613", "n": "Operations and Decision Systems", "f": "SOM", "cr": 3.0, "ac": 2, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Meltem Denizel Karakaya", "ta": 2, "tc": 5}], "ce": 0, "p": 290}, "201101": {"c": "OPIM 613", "n": "Operations and Decision Systems", "f": "SOM", "cr": 3.0, "ac": 7, "ca": 8, "pr": [], "co": [], "i": [{"tn": "Fatma Tevhide Altekin", "ta": 7, "tc": 8}], "ce": 0, "p": 327}, "201801": {"c": "OPIM 613", "n": "Operations and Decision Analytics", "f": "SOM", "cr": 3.0, "ac": 9, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Abdullah Daşcı", "ta": 9, "tc": 20}], "ce": 1, "p": 332}, "202001": {"c": "OPIM 613", "n": "Operations and Decision Analytics", "f": "SOM", "cr": 3.0, "ac": 8, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Ayşe Kocabıyıkoğlu", "ta": 8, "tc": 15}], "ce": 1, "p": 384}, "catList": ["This is the first course in a series of two on operations management focusing on decision problems of developing, producing, and delivering goods.  The purpose is to provide students an exposure to the spectrum of operations management activities and the nature of the related decision problems.  The areas of interest include process and product design, location and capacity planning, quality management and control, production/inventory management, materials management and purchasing, distribution planning, and project management. Tools and techniques used in generating solutions to problems that arise in these and other similar areas are introduced. Operating systems from different sectors such as manufacturing, service, transportation are used as examples to expose students to the similarities and differences in their characteristics. The fundamental principals of several managerial practices such as just-in-time, total quality management, time based competition, business process re-engineering are explored so that students can critically evaluate these and other operational improvement programs.", "This course focuses on decision problems of developing, producing, and delivering goods and services. The purpose is to provide students an exposure to the spectrum of operations management field, the nature of the related decision problems, and applications of various predictive and prescriptive analytical tools. The topics include, but not limited to, process and product design, logistics and transportation, location analysis, production/inventory management, pricing and revenue management, service operations, sustainability, and behavioral operations."]}