{"201102": {"c": "OPIM 408", "n": "Business Intelligence & Marketing Analytics", "f": "SOM", "cr": 3.0, "ac": 39, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Enes Eryarsoy", "ta": 39, "tc": 40}], "ce": 0, "p": 89}, "201201": {"c": "OPIM 408", "n": "Business Intelligence & Marketing Analytics", "f": "SOM", "cr": 3.0, "ac": 18, "ca": 40, "pr": [], "co": ["OPIM 408R"], "i": [{"tn": "Enes Eryarsoy", "ta": 18, "tc": 40}], "ce": 0, "p": 171}, "201902": {"c": "OPIM 408", "n": "Retail Operations and Marketing Analytics", "f": "SOM", "cr": 3.0, "ac": 44, "ca": 50, "pr": [], "co": [], "i": [{"tn": "Burak Gökgür", "ta": 44, "tc": 50}], "ce": 1, "p": 133}, "catList": ["Business Intelligence (BI) mainly refers to extracting and analyzing business data in order to make more informed decisions in a rapidly changing business environment. Marketing Intelligence (MI) can be defined as the practice of gathering, and making sense of the gathered data by analyzing them to accurate decision making in determining relevant market opportunities relevant to a company. This course aims at introducing a variety of techniques and tools that can help businesses tackle problems that they face in today's rapidly changing business environment. The course relies on solving a variety of hands on business and marketing problems, as well as case studies.", "This course aims to provide a thorough understanding of the main functions of retail operations and marketing analytics. In the first part of the course, we will deal with the two major themes of retail operations: assortment planning and product life cycle planning. In assortment planning, the goal is to learn how to determine the set of products a retailer should carry for a store, and how to manage inventory levels of each product in a store. In product life cycle planning,   the objective is to arm students with an overall understanding of forecasting, inventory management, and markdown pricing. We will also discuss how to make data-driven decisions in retail operations. In the second part of the course, we will discuss how to summarize marketing data in MS Excel. We will then learn how to estimate demand and make pricing decisions by using MS Excel. Then, we will study how to develop forecasting methods with MS Excel. We, finally turn our attention to market basket and RFM analyses."]}