{"200802": {"c": "OPIM 406", "n": "Geographic Information Systems (GIS)", "f": "FASS", "cr": 3.0, "ac": 21, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 21, "tc": 30}], "ce": 0, "p": 144}, "200902": {"c": "OPIM 406", "n": "Geographic Information Systems (GIS)", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 9, "tc": 30}], "ce": 0, "p": 264}, "201102": {"c": "OPIM 406", "n": "Geographic Information Systems (GIS)", "f": "SOM", "cr": 3.0, "ac": 10, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 10, "tc": 20}], "ce": 0, "p": 235}, "201302": {"c": "OPIM 406", "n": "Customer Relationship Management using Location Intelligence", "f": "SOM", "cr": 3.0, "ac": 20, "ca": 30, "pr": ["OPIM 506"], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 20, "tc": 30}], "ce": 1, "p": 142}, "201402": {"c": "OPIM 406", "n": "Customer Relationship Management using Location Intelligence", "f": "SOM", "cr": 3.0, "ac": 7, "ca": 50, "pr": ["OPIM 506"], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 7, "tc": 50}], "ce": 1, "p": 311}, "catList": ["This course is an introduction to fundamental concepts related to Geographic Information Systems (GIS), also known more commonly as digital mapping software.  In the first part of the course, students are introduced the basic elements of GIS such as geographic data types and geo-database models,  map projections, cartography tools, and spatial analysis tools. A leading GIS software package is used throughout the course for hands-on exercises and project work. In the second part, various applications of GIS, as used in practical business settings, are covered.", "This course combines customer relationship management (CRM), a key notion in modern-day customer-centric marketing activities, with the emerging field of location intelligence, i.e. use of location data in business decision making. The course is co-taught with a Division Manager in banking industry who is also a CRM expert. After introducing fundamental concepts in CRM as well as geographic data and Geographic Information Systems (GIS), the instructors cover several banking cases where location information is used in CRM and marketing activities, campaigns and promotions to increase the accuracy of customer segmentation and targeted marketing. A leading GIS software package is used throughout the course for hands-on exercises and project work. The final deliverable of the course is a project analysis team report."]}