{"200101": {"c": "HIST 549", "n": "Sources and Methods for 19th and 20th c. Balkan History", "f": "FASS", "cr": 3.0, "ac": 10, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Diana Mishkova", "ta": 10, "tc": 12}], "ce": 0, "p": 69}, "catList": ["This is one of a series of term-courses reviewing sources relevant for the study of Balkan and Ottoman/Turkish history in different periods, as well as methods that have been developed and employed by historians on the basis of different types of sources.  Also included in this group are HIST 561, 572, 581, 591 and 592; students have to take a total of at least two courses form this \"Sources and Methods\" pool during their MA and PhD years. Specifically for Southeast Europe in the 19th and 20th centuries, HIST 549 addresses the major issue of politics and underdevelopment, i.e. the nature, operation and functions (particularly those related to social and economic transformations) of the political sphere in \"late-developing\" societies. It aims to demonstrate the correlations between the  processes of modernization, state-building, and nation- building in the Balkans through integrating (instead of contraposing) social and economic with political history. Balkan modernization will be posited within a broader European context and comparison, thus challenging two widely shared and interlocking concepts/frameworks of interpretation  for the Balkans : (a) the East/West dichotomy  in patterns of social and political development, and (b) the negative perspective on the operation of Balkan politics in general and on Balkan nationalism in particular. The course is structured around four major fields of historical research and interpretation: (1) Economic and social transformations of Balkan societies in the modern period; (2) the social backgrounds, legitimization, and developmental projects of the Balkan political elites; (3) long-term effects of parliamentary institutions in the late-industrializing Balkan societies; and (4) state- building and nation-building experiences in the Balkans as compared to those in other, contemporary European peripheries as well as Western Europe. The unity of these study fields is to be sought in the framework of the historically evolved relationships between social structures, elites, and (modes of) modernization. Chronologically, the course will be divided into two parts : the formative phase of the Balkan national states before World War I; and the inter-war period."]}