{"200502": {"c": "ITM 502", "n": "Foundations of Finance for Managers", "f": "SOM", "cr": 1.5, "ac": 8, "ca": 8, "pr": [], "co": [], "i": [{"tn": "Hakan Orbay", "ta": 8, "tc": 8}], "ce": 0, "p": 220}, "200602": {"c": "ITM 502", "n": "Foundations of Finance for Managers", "f": "SOM", "cr": 3.0, "ac": 8, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Hakan Orbay", "ta": 8, "tc": 12}], "ce": 0, "p": 244}, "200603": {"c": "ITM 502", "n": "Foundations of Finance for Managers", "f": "SOM", "cr": 3.0, "ac": 3, "ca": 3, "pr": [], "co": [], "i": [{"tn": "Hakan Orbay", "ta": 3, "tc": 3}], "ce": 0, "p": 47}, "200702": {"c": "ITM 502", "n": "Foundations of Accounting and Finance for Managers", "f": "SOM", "cr": 3.0, "ac": 12, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Ahmet Can İnci", "ta": 12, "tc": 12}], "ce": 1, "p": 194}, "200802": {"c": "ITM 502", "n": "Foundations of Accounting and Finance", "f": "SOM", "cr": 3.0, "ac": 6, "ca": 8, "pr": [], "co": [], "i": [{"tn": "Jale Sözer Oran", "ta": 6, "tc": 8}], "ce": 2, "p": 296}, "catList": ["Fundamental financial concepts from the perspective as managers are examined and practical applications within local and global contexts are discussed. The topics covered include financial planning, capital budgeting, capital structure, risk-return relationships, decision making under risk, financial statements and ratio analyses, time value of money, net present value analysis.", "The first part of the course covers the basic concepts and principles of financial accounting and reporting, the four basic financial statements and how they are used by interested users in investment and credit decisions. In the latter part of the course, fundamental financial concepts from the perspective as managers are examined and practical applications within local and global contexts are disdussed. The topics covered include financial planning capital budgeting, capital structure, risk-return relationships, decision making under risk, financial ratio analyses, time value of money, net present value analyses. The course is also intended to teach the students basic management terminology that they will encounter in future management courses and in the business world.", "The first part of the course covers basic concepts and principles of financial accounting and reporting, the four basic financial statements and how they are used by managers in investment and credit decisions. In the latter part of the course, fundamental financial concepts from a managerial perspective are examined and practical applications within local and global contexts are discussed. The topics covered include time value of money, net present value analyses, financial planning, capital budgeting, capital structure, risk-return relationships, decision making under risk, financial ratio analyses."]}