{"201702": {"c": "MFG 58000", "n": "Special Topics in MFG: Advanced Topics in Finite Element Analysis", "f": "FENS", "cr": 3.0, "ac": 7, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Eralp Demir", "ta": 7, "tc": 20}], "ce": 0, "p": 374}, "201902": {"c": "MFG 58000", "n": "Special Topics in MFE: Manufacturing Processes for Composite Materials", "f": "FENS", "cr": 3.0, "ac": 17, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Thomas Anthony Cender", "ta": 17, "tc": 20}], "ce": 1, "p": 261}, "catList": ["Advanced Finite Element Analysis aims at teaching advanced level finite element concepts in a mechanics perspective to graduate level students. The course starts with a brief review of fundamental finite element concepts like discretization of equilibrium equation , isoparametric elements, finite element numerical solution methods for elastic problems. Plate & shell elements will be introduced in order for the students to deal with composite mechanics related problems. In the course modeling of the orthotropic (anisotropic) behavior of composites and how to incorporate this material behavior to the finite element models will be shown with examples The most general case of mechanics problems that include material non-linearities and large deformations and their numerical solution methods will be studied. Finally, meshless interpolation concepts such as moving least squares and element free Galerkin methods will be introduced.  Matlab will be used as the coding environment during the course. Students will be asked to implement finite element codes in order to get a better understanding of finite element working principles of a commercial finite element software.", "This course will cover manufacturing processes and modeling for fiber reinforced polymer matrix composite materials. In order to optimize material formation and avoid process induced defects, process engineers need a thorough understanding of the coupling between material transformations, thermo-mechanical response, heat transfer, and viscous fluid flow. Students will be given an overview of applications of composite materials, forming processes, and types of process induced defects which may occur. Constituent materials will be discussed (thermosets, thermoplastics, advanced fibers), along with thermo-mechanical characterization methods and material models. The equations of transport, constitutive laws, and dimensionless analysis will be reviewed and given context in process modeling. Models for short fiber suspensions in injection molding, compression molding, and extrusion will be introduced. Process modeling for continuous fiber reinforcement will include Pultrusion, Sheet Forming, Autoclave processing, Out-of-Autoclave processing, Filament Winding, Automated Fiber Placement, and Liquid Composite Molding."]}