{"200201": {"c": "HIST 692", "n": "Modern Dictatorships and the One-Party Period (1925-1945)", "f": "FASS", "cr": 3.0, "ac": 2, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Cemil Hüsnü Koçak", "ta": 2, "tc": 10}], "ce": 0, "p": 208}, "200301": {"c": "HIST 692", "n": "Modern Dictatorships and the One-Party Period (1925-1945)", "f": "FASS", "cr": 3.0, "ac": 1, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Cemil Hüsnü Koçak", "ta": 1, "tc": 10}], "ce": 0, "p": 264}, "200901": {"c": "HIST 692", "n": "Modern Dictatorships, and the One-Party Period", "f": "FASS", "cr": 3.0, "ac": 7, "ca": 10, "pr": ["POLS 392"], "co": [], "i": [{"tn": "Cemil Hüsnü Koçak", "ta": 7, "tc": 10}], "ce": 1, "p": 318}, "201101": {"c": "HIST 692", "n": "Modern Dictatorships, and the One-Party Period", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Cemil Hüsnü Koçak", "ta": 4, "tc": 10}], "ce": 1, "p": 399}, "catList": ["This course offers an in-depth study of the one- party period and political system in Turkey, placing it in its historical and political context, and introducing primary source materials. Contrasting political alignments had already emerged in the course of the War of Independence; their extensions and ramifications are pursued through the phase immediately preceding the creation of the Republic, down to the end of the Kemalist-dominated early Republican era. The political, cultural, economic and foreign policy dimensions of this entire period are viewed as a whole, though with specific emphasis on its political organizations. The experience of 20th century dictatorships like Fascist Italy, Nazi Germany, or Spain under Franco are drawn upon in constructing a broad comparative framework. May be taken by undergraduates as a taught course (= POLS 392), and simultaneously by graduate students as a research seminar subject to the special requirement of producing a major, 30-page research paper based on primary materials. Subject to the fulfillment of these conditions, counts towards completion of the seminar requirement in History.", "This course offers an in-depth study of the one-party period and political system in Turkey, placing it in its historical and political context, and introducing primary source materials. Contrasting political alignments had already emerged in the course of the War of Independence; their extensions and ramifications are pursued through the phase immediately preceding the creation of the Republic, down to the end of the Kemalist-dominated early Republican era. The political, cultural, economic and foreign policy dimensions of this entire period are viewed as a whole, though with specific emphasis on its political organizations. The experience of 20th century dictatorships like Fascist Italy, Nazi Germany, or Spain under Franco are drawn upon in constructing a broad comparative framework. May be taken by undergraduates as a taught course (= POLS 392), and simultaneously by graduate students as a research seminar subject to the special requirement of producing a major, 30-page research paper based on primary materials. Subject to the fulfillment of these conditions, counts towards completion of the seminar requirement in History."]}