{"200901": {"c": "CS 526", "n": "Motion Planning", "f": "FENS", "cr": 3.0, "ac": 15, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Serkan Mehmet Apaydın", "ta": 15, "tc": 30}], "ce": 0, "p": 199}, "201401": {"c": "CS 526", "n": "Motion Planning", "f": "FENS", "cr": 3.0, "ac": 6, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Esra Erdem", "ta": 6, "tc": 12}], "ce": 0, "p": 362}, "201502": {"c": "CS 526", "n": "Motion Planning", "f": "FENS", "cr": 3.0, "ac": 12, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Esra Erdem", "ta": 12, "tc": 20}], "ce": 1, "p": 270}, "catList": ["The goal of motion planning is to enable robots to automatically compute their motions from high-level descriptions of tasks and models acquired through sensing. Over the years, motion planning has become a major research area in robotics. The techniques developed for robotics were not only used to create robots with motion autonomy, such as mobile robots navigating indoors, but also used in other domains, such as computer animation, computer-aided design, verification of building codes, exploration of virtual environments, and computational biology. Today, progress in motion planning is increasingly motivated by these applications. is to provide a coherent framework of motion planning algorithms. There will also be a discussion of existing methods to solve specific problems. Examples to the algorithms will be presented from the domains of mechanical design, manufacturing, medical surgery, computational biology.  The focus will be on robust, efficient, and practical algorithms, with some form of provable guarantee of performance, over purely heuristic techniques or with optimum worst-case performance. self-contained; however the students are expected to have an interest in geometry and algorithms, and to have the skills to complete a significant programming assignment. The course will benefit students who may come from different backgrounds (e.g., computer science, mechatronics, electrical engineering, etc.). This course is primarily based on the course `Motion planning?, by Prof. Jean-Claude Latombe at Stanford University. No textbook is required. Here is a tentative syllabus: 1. Overview, 2. Path planning for a point robot, 3. Configuration space of a robot, 4. Probabilistic Roadmaps, 5. Collision detection and distance computation, 6. Sampling and connection strategies for probabilistic roadmaps, 7. Critycality based motion planning : target finding, 8. Coordination of multiple robots, 9. Humanoid and legged robots, 10. Mapping and inspecting environments, 11. Navigation through virtual environments, 12. Target tracking and virtual cameras, 13. Motion of crowds and flocks, 14. Surgical planning, 15. Motion of bio-molecules.", "Motion planning aims at generating sequences of motions for physical/virtual entities, such as robots, robot teams, animated characters, and molecules. This course provides an elementary but algorithmically solid introduction to motion planning as well as an understanding of some of its applications in robotics. It covers the major topics of motion planning including (but not limited to) configuration spaces, search-based motion planning, sampling-based motion planning, and integration of task and motion planning."]}