{"199901": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 6, "pr": [], "co": [], "i": [{"tn": "Halil Berktay", "ta": 3, "tc": 6}], "ce": 0, "p": 20}, "200101": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 7, "ca": 10, "pr": ["HIST 501", "HIST 501"], "co": [], "i": [{"tn": "Halil Berktay", "ta": 7, "tc": 10}], "ce": 1, "p": 93}, "200301": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 7, "pr": ["HIST 501", "HIST 502", "HIST 501", "HIST 502"], "co": [], "i": [{"tn": "Jitka Maleckova", "ta": 4, "tc": 7}], "ce": 1, "p": 229}, "200401": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 20, "pr": ["HIST 501", "HIST 502", "HIST 501", "HIST 502"], "co": [], "i": [{"tn": "Pablo Sanchez Leon", "ta": 4, "tc": 20}], "ce": 1, "p": 260}, "200701": {"c": "HIST 511", "n": "- Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 20, "pr": ["HIST 501", "HIST 502", "HIST 501", "HIST 502"], "co": [], "i": [{"tn": "Fikret Adanır", "ta": 6, "tc": 20}], "ce": 2, "p": 305}, "200801": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Fikret Adanır", "ta": 4, "tc": 10}], "ce": 2, "p": 354}, "201001": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 5, "ca": 16, "pr": [], "co": [], "i": [{"tn": "Saygın Salgırlı", "ta": 5, "tc": 16}], "ce": 2, "p": 369}, "201201": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 16, "pr": [], "co": [], "i": [{"tn": "Saygın Salgırlı", "ta": 9, "tc": 16}], "ce": 2, "p": 317}, "201301": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 16, "pr": [], "co": [], "i": [{"tn": "Saygın Salgırlı", "ta": 3, "tc": 16}], "ce": 2, "p": 441}, "201501": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 16, "pr": [], "co": [], "i": [{"tn": "Ayşe Ozil", "ta": 4, "tc": 16}], "ce": 2, "p": 414}, "201701": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 2, "ca": 16, "pr": [], "co": [], "i": [{"tn": "Ayşe Ozil", "ta": 2, "tc": 16}], "ce": 2, "p": 443}, "201901": {"c": "HIST 511", "n": "Trends, Debates, Historians I", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Ayşe Ozil", "ta": 6, "tc": 10}], "ce": 2, "p": 408}, "catList": ["", "The Historiography sequence of HIST 511-512 is required of all PhD students in History, and while it may also be taken by MA students, in all cases it should be taken after HIST 501-502 or some other, comparable survey of world or at least European history. This is necessary because \"Trends, Debates, Historians\" adopts an approach to the study of Historiography that is historical in more than one sense. It proposes to study methodology not in the abstract but in the concrete, as embodied in the output of a number of great historians living and working in the 20th century; naturally it strives to relate each such historian to his/her context and preferred paradigm; but it also situates each such contribution within the framework of the period problematic and literature to which it pertains. This This means that works studied are taken up in the chronological order of their subject matter, i.e. of the historical period to which they refer (rather than by reference to their authors in chronological sequence). Furthermore, as a side objective of the course is to study problems of overall organization and sustained consistency in writing synthetic books (as opposed to research articles), in both semesters the emphasis is on reading complete books by leading-edge historians. Thus HIST 511 deals with a total of eight books by M. I. Finley, George Thomson and Keith Hopkins as historians of Antiquity, plus Pirenne, Bloch, Hilton, Duby and Le Roy Ladurie as as historians of Medieval Europe. The last five are also scrutinized for the methodological insights they might shed into Ottoman historical studies. Throughout, two basic questions are repeatedly posed : From Herodotos and Thucydides through the 19th century down to the present, what has changed and what has not changed in the practice of historians ?", "The Historiography sequence of HIST 511-512 is required of all PhD students in History, and while it may also be taken by MA students, in all cases it should be taken after HIST 501-502 or some other, comparable survey of world or at least European history. This is necessary because ''Trends, Debates, Historians'' adopts an approach to the study of Historiography that is historical in more than one sense. It proposes to study methodology not in the abstract but in the concrete, as embodied in the output of a number of great historians living and working in the 20th century; naturally it strives to relate each such historian to his/her context and preferred paradigm; but it also situates each such contribution within the framework of the period problematic and literature to which it pertains. This means that works studied are taken up in the chronological order of their subject matter, i.e. of the historical period to which they refer (rather than by reference to their authors in chronological sequence). Furthermore, as a side objective of the course is to study problems of overall organization and sustained consistency in writing synthetic books (as opposed to research articles), in both semesters the emphasis is on reading complete books by leading- edge historians. Thus after opening with a few introductory texts of a general nature plus an initial set of readings on historians' own views of their profession, HIST 511 quickly moves into sampling works by historians of Antiquity, followed by close readings of some leading Medievalists. These and others are also scrutinized for the methodological insights they might shed into Ottoman historical studies. Controversies among Turkish as well as European scholars on the nature of serfdom, feudalism, or the feudal mode of production, as well as the more recent ''feudal revolution'' debate, are treated through special files interpolated where necessary. Throughout, two basic questions are repeatedly posed : From Herodotos and Thucydides, through the 19th century, down to the present, what has changed and what has not changed in the practice of historians ?"]}