{"201303": {"c": "ETM 506", "n": "Decision Making & Regulations in Energy", "f": "FENS", "cr": 3.0, "ac": 10, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Kemal Kılıç", "ta": 10, "tc": 15}], "ce": 0, "p": 67}, "201402": {"c": "ETM 506", "n": "Decision Making & Regulations in Energy", "f": "FENS", "cr": 3.0, "ac": 25, "ca": 30, "pr": [], "co": [], "i": [{"tn": "İzak Atiyas", "ta": 25, "tc": 30}], "ce": 0, "p": 135}, "201502": {"c": "ETM 506", "n": "Decision Making & Regulations in Energy", "f": "FENS", "cr": 3.0, "ac": 21, "ca": 35, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 21, "tc": 35}], "ce": 0, "p": 179}, "201602": {"c": "ETM 506", "n": "Energy Regulations and Laws", "f": "FENS", "cr": 3.0, "ac": 18, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 18, "tc": 30}], "ce": 0, "p": 223}, "201702": {"c": "ETM 506", "n": "Energy Regulations and Laws", "f": "FENS", "cr": 3.0, "ac": 15, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 15, "tc": 25}], "ce": 0, "p": 268}, "201802": {"c": "ETM 506", "n": "Energy Regulations and Laws", "f": "FENS", "cr": 3.0, "ac": 13, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Cengiz Güneş", "ta": 13, "tc": 30}], "ce": 1, "p": 284}, "catList": ["Part I: Decision Making Company managers and/or technical staff from all levels face decision problems daily. That is also the case for energy companies. These problems usually have multiple decisions in time, uncertain events, conflicting objectives and multiple decision makers. Therefore, familiarity with various decision problems that are common for energy companies and in-depth understanding of appropriate techniques to model and solve such problems would definitely to model and solve such problems would definitely decision makers.  At the end of the semester, the students will be able to formulate such decision making problems and learn techniques that can be used to solve the models. The course also aims to introduce various problems that decision makers face in energy field. The techniques/analytical approaches that the course will address (but not limited to): Modeling Decisions ( Decision Trees / Influence Diagrams/Sensitivity Analysis), Modeling Uncertainty (Bayes’ Theorem /Value of Information / Approximation of Continuous Distributions / Monte Carlo Simulation), Modeling Preferences (Risk and Preference / Utility Theorem / Multi Attribute Utility /Multi Criteria Decision Making such as AHP, ELECTRE, PROMETHEE). These analytical techniques will be introduced by cases on various decision making problems that are faced in energy companies. These problems will include (but not limited to): Energy Investment Decision Making, Technology Selection Problems, Infrastructure Selection Problem, Renewable /Sustainable Energy Planning, Planning Local Energy Systems,…etc. There will also be a slight discussion the psychological aspects of decision making, particularly decision making heuristics and biases associated with the heuristics, predictably irrational decisions, etc. Part II: Regulations: The purpose of this part of the module is to review the legal and regulatory basis of reform in the anegy and in particular the electricity industry.  The module covers the following topics: i) the new energy law and regulations and post-privatization problems in Turkey; ii) Market failures, regulation, liberalization and competition in electricity markets; iii) basic components of electricity reform in Turkey and the European Union.", "General structure of energy markets, market actors, physical and trade relations. Power market activities, boundaries and obligations. Pre-license and license processes, unlicensed production. Legal framework and investment models for power production. Legal framework and characteristics of transmission and other activities. Legal framework for the power grid and the right to connect. Regulations about renewable power resources. Security of supply and capacity mechanisms. Government subsidies, incentives and their effects on power markets. Privatization: legal framework, regulation and models. International agreements (e.g., TANAP) and regulation. Project financing and regulation. Auditing: Legal framework for sanctions and legal mechanisms. Discussions on current issues case studies and contract analyses."]}