{"201702": {"c": "IT 541", "n": "Introduction to Data Science", "f": "FENS", "cr": 3.0, "ac": 24, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 24, "tc": 40}], "ce": 0, "p": 195}, "201802": {"c": "IT 541", "n": "Introduction to Machine Learning", "f": "FENS", "cr": 3.0, "ac": 23, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 23, "tc": 40}], "ce": 1, "p": 208}, "201902": {"c": "IT 541", "n": "Introduction to Machine Learning", "f": "FENS", "cr": 3.0, "ac": 24, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 24, "tc": 40}], "ce": 1, "p": 201}, "catList": ["Data Science is the study of extracting information from data. Addressing the needs of the industry requires skills in data processing and data analytics spanning a wide  area of subjects ranging from Statistics to Machine Learning. This course will introduce some of the basic concepts, techniques and tools that are required to solve problems widely seen in data analytics. The course wil  start with a short review on inferencial Statistics and exploratory data analysis. The focus in the study of these subjects will be breadth, rather than depth, and practical examples will be used in applications of classification and clustering techniques to a wide variety of problems in predictive data analytics.", "Data Science is the study of extracting information from data. Addressing the needs of the industry requires skills in data processing and data analytics spanning a wide area of subjects ranging from Statistics to Machine Learning. This course will introduce some of the basic concepts, techniques and tools that are required to solve problems widely seen in data analytics. The course wil start with a short review on inferencial Statistics and exploratory data analysis. The focus in the study of these subjects will be breadth, rather than depth, and practical examples will be used in applications of classification and clustering techniques to a wide variety of problems in predictive data analytics."]}