{"201503": {"c": "ETM 517", "n": "Advanced Topics in Renewable Energy Technologies", "f": "FENS", "cr": 3.0, "ac": 12, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Burcu Saner Okan", "ta": 12, "tc": 30}], "ce": 0, "p": 78}, "201603": {"c": "ETM 517", "n": "Advanced Topics in Renewable Energy Technologies", "f": "FENS", "cr": 3.0, "ac": 10, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 10, "tc": 30}], "ce": 0, "p": 57}, "201703": {"c": "ETM 517", "n": "Advanced Topics in Renewable Energy Technologies", "f": "FENS", "cr": 3.0, "ac": 9, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 9, "tc": 30}], "ce": 0, "p": 66}, "201801": {"c": "ETM 517", "n": "Renewable Energy Systems", "f": "FENS", "cr": 3.0, "ac": 14, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Murat Kaya", "ta": 14, "tc": 30}], "ce": 1, "p": 262}, "202001": {"c": "ETM 517", "n": "Renewable Energy Systems", "f": "FENS", "cr": 3.0, "ac": 16, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Ömer Emre Orhan", "ta": 16, "tc": 30}], "ce": 1, "p": 266}, "catList": ["Under this module, renewable energy technologies such as \" wind \" \" solar\" \" hydro\", \" geothermal \", \" biomass\", \"nuclear \" energy technologies and energy storage technologies will be discussed . Issue to be examined under the headings are as follows: Theoretical and practical efficiency of thermo-photovoltaic cells, organic PV technology, measurement of solar potential, calculation of solar power plant efficiency, economic and technical feasibility analysis, system design alternatives (off grid, on-grid). Wind energy and assessment, vertical and horizontal turbines, small and large scale systems, safety and reliability, wind turbine siting, system design and integration, measurement, control systems, design and performance of wind turbines, economics and cost analysis. Geothermal energy in the world, use of geothermal energy in Turkey, geothermal energy capacity and potential of Turkey, direct use and power generation, origin of geothermal energy and types of geothermal systems, assessment of geothermal systems/reservoirs, production and reservoir engineering concepts, wellbore fluid and heat flow, reservoir modeling, reinjection, cost analysis, technical feasibility. Nuclear reactor and classifications, physical and engineering principles of nuclear reactors, power plants, reactor design, reactor parameters, basic plant components, safety concerns and measures. General principles of energy storage, electrochemical storage, capacitive storage, future of storage systems, cost analysis. Basic terms and principles in hydroelectric technologies. Classification of hydroelectric plants and their principles of work. Storage systems, their principles of work. Types of turbines, Cost and benefit analysis. Anaerobic biochemical treatment processes for organic wastes. Bioenergy recovery potentials of different organic waste streams.", "Technical details about renewable energy (wind, solar, hydro, geothermal, biomass/ bioenergy, storage). Basic renewable energy equations and calculations based on different energy sources. Fundamentals leading to technical comprehension of how these sources are being used. Details about different renewable energy technology equipment."]}