{"201302": {"c": "ETM 504", "n": "Energy Markets", "f": "FENS", "cr": 3.0, "ac": 11, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 11, "tc": 25}], "ce": 0, "p": 233}, "201402": {"c": "ETM 504", "n": "Energy Markets", "f": "FENS", "cr": 3.0, "ac": 25, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Ümit Özden", "ta": 25, "tc": 30}], "ce": 0, "p": 135}, "201502": {"c": "ETM 504", "n": "Energy Markets", "f": "FENS", "cr": 3.0, "ac": 21, "ca": 35, "pr": [], "co": [], "i": [{"tn": "Ümit Özden", "ta": 21, "tc": 35}], "ce": 0, "p": 179}, "201602": {"c": "ETM 504", "n": "Energy Markets", "f": "FENS", "cr": 3.0, "ac": 17, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 17, "tc": 30}], "ce": 0, "p": 232}, "201701": {"c": "ETM 504", "n": "Energy Markets", "f": "FENS", "cr": 3.0, "ac": 16, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 16, "tc": 25}], "ce": 0, "p": 235}, "201802": {"c": "ETM 504", "n": "Energy Markets", "f": "FENS", "cr": 3.0, "ac": 13, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Cengiz Güneş", "ta": 13, "tc": 30}], "ce": 1, "p": 284}, "catList": ["Scene Setting: Global Renewable Energy Markets with a Focus on Electricity. Understanding: Fundamentals of Renewable Energy Segments: Hydro, Solar, Geothermal, Wind, Biogas. Segment Structures, Dynamics, FITs, Subsidies for Turkish Market. Investing: Investment Planning: Allocation of Power Generation Assets . Projects Selection and Development. Load and Price Forecasting for Feasibility. Environmental Impact Assessment, Carbon Certificates. Project Financing. Overview of Licensing, Power Systems, Site Development, Grid Connections Process, and Regulations. Plant Operations in Real Life (Site Visits by Power Plant Type Groups). Money Making: Electricity Spot Markets (PMUM and Energy Exchanges). Electricity Wholesale and Retail Markets in Turkey. Getting Ready for Future: Major Trends, Business Opportunities and Challenges Scenario Planning for the Future.", "Energy market relations and models. Power markets: participants, operation, load management. Bilateral contracts, day-ahead market, balancing market, ancillary services market. Regional markets, export and import. Financial markets and products. Natural gas market operations, supply markets. Introduction to price forecasting models."]}