{"200301": {"c": "HIST 653", "n": "Aspects of Ottoman Rule in theBulgarian Lands in the Pre-Tanzimat Period", "f": "FASS", "cr": 3.0, "ac": 1, "ca": 7, "pr": ["HIST 561", "HIST 561"], "co": [], "i": [{"tn": "Rossitsa Stefanova Gradeva", "ta": 1, "tc": 7}], "ce": 0, "p": 264}, "catList": ["Focuses on selected issues and specific features of Ottoman rule in the Bulgarian lands, and therefore requires some previous, preliminary knowledge of Ottoman history and documentation. The main themes addressed will include : early Ottoman administration (from the 15th to the early 16th centuries); the Ottoman judicial system and the functioning of the kadı court; agrarian relations : timars, vakıfs, çiftliks; monuments of Ottoman culture; towns and urban society; Osman Pazvandoğlu of Vidin against the backdrop of Kırcalı / dağlı unrest; the National Awakenings of the Balkan peoples; the international situation at the end of the 18th and the beginning of the 19th centuries. At he same time, the core of the course will revolve around the official status and the real situation of various ethno-religious groups (such as the Orthodox Christians and the Jews) : their institutions; their attitudes vis-à-vis the Ottoman authorities; questions of Islamisation, and of neo-martyrs; church building and restoration; other and related problems. Assessment will be based on participation throughout the course, including short presentations, as well as a final paper of around 30 pages based on an appropriate amount of work on the primary sources as well as the secondary literature. Subject to these conditions, counts towards fulfilling the seminar requirement in History while also serving as a course in advanced paleography. Students submitting only a shorter paper based just on the seconary literature (instead of a major research paper as described above) may obtain credit only for a taught course, and not a seminar. (Also see HIST 553.) Prerequisites for HIST 653 : HIST 561 or the equivalent, plus an adequate knowledge of Ottoman Turkish, subject to the instructor's approval."]}