{"200202": {"c": "HIST 462", "n": "Ottoman Reform Movements II: Political and Social (1839-1918)", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Selçuk Akşin Somel", "ta": 6, "tc": 20}], "ce": 0, "p": 166}, "200401": {"c": "HIST 462", "n": "Ottoman Reform Movements II: Political and Social (1839-1918)", "f": "FASS", "cr": 3.0, "ac": 8, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Selçuk Akşin Somel", "ta": 8, "tc": 25}], "ce": 0, "p": 199}, "200701": {"c": "HIST 462", "n": "Ottoman Reform Movements II:Political and Social Reforms (1839-1918)", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 20, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Selçuk Akşin Somel", "ta": 9, "tc": 20}], "ce": 1, "p": 243}, "catList": ["Intellectual and social issues prevalent in present- day Turkey have their antecedents in 19th century Ottoman Empire. Ottoman 19th century was a period where old and new, reform and reaction met each other. In fact, this was an era where the empire was shaken by series of wars and crisis of disintegration. Reformist bureaucrats applied policies to forestall this process, while the intelligentsia vehemently opposed authoritarian reforms. Discussions on the future of the empire became most fruitful during the first four years of the Second Constitutional Period (1908-1912) when people enjoyed some degree of liberal freedom. Public discussions came to an abrupt end when the Committee of Union and Progress established military dictatorship (1913-1918). As a whole, this \"long nineteenth century\" was an era where institutional foundations of Turkish modernization were laid down. This course aims to introduce, discuss, and understand Ottoman reform movements and thoughts of the last hundred year of Ottoman existence, based on the evaluation of reformist statesmen of the Tanzimat-period, oppositional intellectuals of the 1860s and 1870s, conservative attitude of Hamidian absolutism (1878-1908), and Young Turk reformist ideas of the last decades of Ottoman existence (1889-1918).", "Intellectual and social issues that are still very much alive in present-day Turkey have their antecedents in the 19th century Ottoman empire. The Ottoman 19th century was a period where old and new, reform and reaction met and mingled, and simultaneously confronted each other. This was also a time when the empire was shaken by a series of wars and crises of disintegration. Reformist bureaucrats implemented policies intended to forestall this process, while the intelligentsia vehemently opposed authoritarian reforms. Debates around the future of the empire became most fruitful during the first four years of the Second Constitutional Period (1908-1912), when people enjoyed some degree of liberal freedom. But public discussion came to an abrupt end when the Committee of Union and Progress established its military dictatorship (1913-1918). As a whole, this ''long 19th century'' was when the institutional foundations of Turkish modernization were laid down. This course aims to introduce, discuss, and understand Ottoman reform movements and ideas of the last hundred years of Ottoman existence, based on evaluations of reformist statesmen of the Tanzimat period, of oppositional intellectuals of the 1860s and 1870s, of the conservative stance adopted by Hamidian absolutism (1878-1908), and the Young Turk reformist ideas of the last decades of the Ottoman empire (1889-1918)."]}