{"200102": {"c": "VA 432", "n": "Vision, Representation and Cinema", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Hasan B端lent Kahraman", "ta": 9, "tc": 20}], "ce": 0, "p": 82}, "200202": {"c": "VA 432", "n": "Vision, Representation and Cinema", "f": "FASS", "cr": 3.0, "ac": 16, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Hasan B端lent Kahraman", "ta": 16, "tc": 20}], "ce": 0, "p": 81}, "200503": {"c": "VA 432", "n": "Vision, Representation and Cinema", "f": "FASS", "cr": 3.0, "ac": 8, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Defne T端z端n", "ta": 8, "tc": 20}], "ce": 0, "p": 43}, "200602": {"c": "VA 432", "n": "Vision, Representation and Cinema", "f": "FASS", "cr": 3.0, "ac": 16, "ca": 27, "pr": [], "co": [], "i": [{"tn": "Asuman Feride Suner Zontul", "ta": 16, "tc": 27}], "ce": 0, "p": 161}, "catList": ["Cinema is the art of the 20th century. Though its birth goes all the way back to the 19th century it is, in this long century that cinema has been the medium of high and low art, the medium of propaganda and popular culture. The show and entertainment business of the last century and the consumer culture came out has both contributed to and benefited from the cinema. On the other hand, cinema has transformed the visual culture dramatically as a matter of visuality. It is after the introduction of the movies of the 1920s that human understanding of visuality has taken a radical shift as a consequence of cinema's relation to various aspects, such as psychoanalysis In this regard cinema might be taken as the basic art of the past century with none of the realms of art and social life being ignorant to it. The course will expose the students to the reality both produced and transformed in cinema. Each week a certain field, such as history, politics, psychoanalysis, gender, marginality, will be selected and accordingly films will be analysed to find out how the reality of that specific area is represented. On the background the students will discuss and analyse the basic concerns and concepts of modernity. The course, in this context, will conjointly survey the history, problematics and arts of the past century as well as the adventure of cinema as a technique and art."]}