{"200902": {"c": "MGMT 602", "n": "Doctoral Seminar in Strategic Management", "f": "SOM", "cr": 3.0, "ac": 7, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Ayşe Karaevli Yurtoğlu", "ta": 7, "tc": 10}], "ce": 0, "p": 293}, "201102": {"c": "MGMT 602", "n": "Doctoral Seminar in Strategic Management", "f": "SOM", "cr": 3.0, "ac": 6, "ca": 16, "pr": [], "co": [], "i": [{"tn": "Ayşe Karaevli Yurtoğlu", "ta": 6, "tc": 16}], "ce": 0, "p": 310}, "201402": {"c": "MGMT 602", "n": "Doctoral Seminar in Strategic Management", "f": "SOM", "cr": 3.0, "ac": 4, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Işın Güler", "ta": 4, "tc": 5}], "ce": 0, "p": 369}, "201602": {"c": "MGMT 602", "n": "Doctoral Seminar in Strategic Management", "f": "SOM", "cr": 3.0, "ac": 2, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Remzi Gözübüyük", "ta": 2, "tc": 5}], "ce": 0, "p": 440}, "catList": ["This course involves a critical review of theory and research in the field of strategic management. The scope of the course is comprehensive, encompassing the following domains: strategic content, strategic processes, top executives, and corporate governance. Particular emphasis is placed on empirical study of strategic issues. The course is intended for doctoral students who expect to conduct research in strategic management or related areas (e.g., organizational theory, organizational behavior, marketing strategy, corporate finance, industrial organization, sociology of organizations, operational strategy). Each session we will examine a sub-field of strategic management. The topics include origins of the field of strategic management, conceptualizing and operationalizing strategy, industrial and organizational economics view of strategy, resource-based view of the strategy, learning and knowledge-based view of strategy, corporate level strategy (diversification and M&A/divestitures), international strategy and strategy in emerging markets, top executives and the upper-echelons perspective, governance and agency theory, strategic decision making, and strategy and organizational design. Our approach will typically involve reading the seminal works, synthesizing the theories/perspectives on the topic and examining in depth several empirical works."]}