{"200002": {"c": "VA 524", "n": "Visual Culture and Ideology", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Hasan Bülent Kahraman", "ta": 3, "tc": 10}], "ce": 0, "p": 87}, "200102": {"c": "VA 524", "n": "Visual Culture and Ideology", "f": "FASS", "cr": 3.0, "ac": 2, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Hasan Bülent Kahraman", "ta": 2, "tc": 5}], "ce": 1, "p": 173}, "200202": {"c": "VA 524", "n": "Visual Culture and Ideology", "f": "FASS", "cr": 3.0, "ac": 7, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Hasan Bülent Kahraman", "ta": 7, "tc": 10}], "ce": 2, "p": 148}, "200502": {"c": "VA 524", "n": "Visual Culture and Ideology", "f": "FASS", "cr": 3.0, "ac": 13, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Eser Selen", "ta": 13, "tc": 20}], "ce": 2, "p": 158}, "catList": ["", "This course will review methods of the analysis of the visual, which have been influential in contesting the meanings produced by an expansive array of visual procedures, including photography, film, television and design. The analyses of these particular forms and techniques will enable the reconsideration of understandings of social life. A review of methods of the analysis of visual culture, from structuralism and semiotics to deconstruction, will lead to a consideration of how the visual may be understood as definitive of the assumptions of identity, national, religious, sexual and/or political.", "The recent analysis pertaining to the concepts of identity, gender, self, recognition, difference binds together the political and the visual. However, beyond this, the 'ways of seeing' is a matter of cultural in a broader sense. The culture component, in the late twentieth century, does not only stand for the anthropological research but goes more for the analysis of the techniques of media productions. Television images, the world of advertisement, the consumption culture are the relevant realms of the visual culture productions. In the course two major fields of analysis semiotics and structuralism and deconstructionism will be covered as tools for the dismantling of the existing norms. Together with that the student will be exposed to the analysis of the different visual productions such as photography, television, graphic design, painting and sculpture as well as documentaries. The role of the real and virtual within this body will be considered as one of the major problematic of the course and these will be analysed with regard to gender, sexuality, political matters."]}