{"200001": {"c": "POLS 521", "n": "Politics of Representation and Identity", "f": "FASS", "cr": 3.0, "ac": 8, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Ayhan Mehmet Akman", "ta": 8, "tc": 10}], "ce": 0, "p": 49}, "200002": {"c": "POLS 521", "n": "Politics of Representation and Identity", "f": "FASS", "cr": 3.0, "ac": 1, "ca": 3, "pr": [], "co": [], "i": [{"tn": "Ayhan Mehmet Akman", "ta": 1, "tc": 3}], "ce": 0, "p": 119}, "200101": {"c": "POLS 521", "n": "Politics of Representation and Identity", "f": "FASS", "cr": 3.0, "ac": 2, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Ayhan Mehmet Akman", "ta": 2, "tc": 10}], "ce": 1, "p": 162}, "200201": {"c": "POLS 521", "n": "Politics of Representation and Identity", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Ayhan Mehmet Akman", "ta": 4, "tc": 15}], "ce": 1, "p": 185}, "200501": {"c": "POLS 521", "n": "Politics of Representation and Identity", "f": "FASS", "cr": 3.0, "ac": 11, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Ayhan Mehmet Akman", "ta": 11, "tc": 20}], "ce": 1, "p": 173}, "catList": ["", "This course will explore issues of representation and identity in the context of cultural pratices. It is concerned with clarifying processes of identity formation and transformation, especially as they take place in the political and cultural realms. The notion of 'representation' does not refer to electoral or to institutional representation narrowly understood but aims to capture the cultural and symbolic aspects of representation that have political and institutional repercussions. For these purposes,  the course will analyze the myriad relationships among multiple forms of representation and the macro-social processes shaping the contemporary world as well as engaging in the current political debate and polemics that revolve around these ssues. Therefore, issues of multiculturalism, politics of difference and postmodernity will be taken up alongside issues of performativity, feminism, masculinity, surrealism and pornography. Our overriding concern will be to gain self-understanding regarding the  identities we assume, reject or negotiate with. In other words, the ultimate speculative thrust of this course is to further our self-reflexivity with respect to our academic practices as well as our personal identities."]}