{"200701": {"c": "OPIM 530", "n": "Developing Spreadsheet Models 2", "f": "SOM", "cr": 1.5, "ac": 10, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Nihat Kasap", "ta": 10, "tc": 25}], "ce": 0, "p": 227}, "200801": {"c": "OPIM 530", "n": "Developing Spreadsheet Models 2", "f": "SOM", "cr": 1.5, "ac": 6, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Can Akkan", "ta": 6, "tc": 20}], "ce": 0, "p": 308}, "200901": {"c": "OPIM 530", "n": "Programming in VBA for Excel", "f": "SOM", "cr": 1.5, "ac": 9, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 9, "tc": 15}], "ce": 1, "p": 278}, "201101": {"c": "OPIM 530", "n": "Programming in VBA for Excel", "f": "SOM", "cr": 1.5, "ac": 5, "ca": 20, "pr": ["MFIN 525"], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 5, "tc": 20}], "ce": 2, "p": 374}, "201301": {"c": "OPIM 530", "n": "Programming in VBA for Excel", "f": "SOM", "cr": 1.5, "ac": 2, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 2, "tc": 15}], "ce": 2, "p": 462}, "201401": {"c": "OPIM 530", "n": "Programming in VBA for Excel", "f": "SOM", "cr": 1.5, "ac": 4, "ca": 30, "pr": ["MFIN 525"], "co": [], "i": [{"tn": "Burçin Bozkaya", "ta": 4, "tc": 30}], "ce": 2, "p": 397}, "catList": ["The objective of this course is to provide the skills necessary to efficiently develop analytical spreadsheet models in MS Excel that meet professional standarts. Upon successful completion of the course, the student should be able to understand basic VBA consepts and develop Excel based decision support models that help making effective decisions and performing data analysis using VBA.", "The objective of this course is to provide the fundamentals necessary to develop VBA programs in Excel, so that interested students can later take the follow-up course OPIM 531 to learn developing decision support tools in Excel. The course assumes no prior programming experience and emphasizes the importance of following a professional style in writing code. Working with ranges, and other Excel objects, developing user forms, error handlings are covered in addition to basic building blocks of VBA programming", "The objective of this course is to provide the fundamentals necessary to develop VBA programs in EXcel and to teach how to develop decision support tools in Excel that use management science and statistical models for a wide variety of business problems, mostly from operations management and finance. The course assumes no prior programming experience and emphasizes the importance of following a professional style in writing code. Working with ranges, and other Excel objects, developing user forms, error handlings are covered in addition to basic building blocks of VBA programming. To support model development, importing data from databases, working with pivot tables, and automating Solver are also covered in the course. Upon completion of the course, students should be able to develop modest but useful applications of their own."]}