{"200301": {"c": "HART 623", "n": "Visions Of Power", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Bratislav Pantelic", "ta": 6, "tc": 10}], "ce": 0, "p": 206}, "200601": {"c": "HART 623", "n": "Art and Power", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Faik Gür", "ta": 9, "tc": 15}], "ce": 0, "p": 233}, "200702": {"c": "HART 623", "n": "Art and Power", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 3, "pr": [], "co": [], "i": [{"tn": "Bratislav Pantelic", "ta": 3, "tc": 3}], "ce": 0, "p": 349}, "200801": {"c": "HART 623", "n": "Art and Power", "f": "FASS", "cr": 3.0, "ac": 10, "ca": 11, "pr": [], "co": [], "i": [{"tn": "Bratislav Pantelic", "ta": 10, "tc": 11}], "ce": 0, "p": 246}, "201501": {"c": "HART 623", "n": "Art and Power", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 10, "pr": ["HART 323"], "co": [], "i": [{"tn": "Bratislav Pantelic", "ta": 6, "tc": 10}], "ce": 0, "p": 381}, "catList": ["This course examines the role of the visual arts and architecture in the representation of political power and ideology. Images can bear very potent meanings. These meanings are sometimes buried in complex symbolism and conveyed through attributes and emblems, while seemingly insignificant gestures, postures, and motifs can denote sophisticated state, dynastic, and ideological associations. Apart from addressing a variety of themes pertaining to legitimacy of rulership, notions of sacred kingship, and references to mythical archetypes that shaped the image of the ruler over centuries, imagery was used also to convey and promote fundamental values of the prevailing ideology, the social order, and the myths that shaped the cultural outlook of an age. Thus 18th century ideals of progress, industrialization, and democracy were accompanied by admiration of the classical world, and a desire to achieve those moral values that were believed to have existed in Antiquity. Consequently, ornate Baroque façades gave way to Greco-Roman temple fronts while grand history themes replaced fanciful Baroque allegories. After the Napoleonic wars the search for identity shifted to national history and the glorification of the Middle Ages, initiating a surge of Gothic-style buildings while images of the knights replaced the heroic nudes of the Classicist revival. This romantic medievalism was followed by yet another myth. Rekindling the age-old quest for Paradise, early 20th century political ideology competed with religion in promising a society that would offer prosperity and social justice, generating images of a utopian classless society of contended workers and peasants. As much as imagery can reflect the cultural outlook of an age and reveal its significant postulates, architecture remains the most explicit manifestation of political power. Through symbolic language, direct or indirect associations, and references to celebrated buildings of the past or to sacred or highly revered sites, architecture is imbued with complex meanings that convey messages of continuity, power, and sanctity, or commemorate deceased rulers and ensure legitimacy to their successors. Guiding students into in-depth studies of these and related themes, HART 623 counts towards the fulfilment of the graduate seminar requirement in History subject to the completion of a major research paper (of around 30 pages) making significant use of primary resource materials. Also see HART 323 for the possibility of being taken simultaneously as an undergraduate course without the special seminar requirements."]}