{"201503": {"c": "FIN 958", "n": "Global Financial Markets", "f": "SOM", "cr": 1.5, "ac": 52, "ca": 78, "pr": [], "co": [], "i": [{"tn": "Mustafa Erol Balkan", "ta": 52, "tc": 78}], "ce": 0, "p": 19}, "201602": {"c": "FIN 958", "n": "Global Financial Markets", "f": "SOM", "cr": 1.5, "ac": 38, "ca": 60, "pr": [], "co": [], "i": [{"tn": "Mustafa Erol Balkan", "ta": 38, "tc": 60}], "ce": 0, "p": 135}, "201702": {"c": "FIN 958", "n": "Global Financial Markets", "f": "SOM", "cr": 1.5, "ac": 10, "ca": 50, "pr": [], "co": [], "i": [{"tn": "Mustafa Erol Balkan", "ta": 10, "tc": 50}], "ce": 0, "p": 337}, "201802": {"c": "FIN 958", "n": "Global Financial Markets", "f": "SOM", "cr": 1.5, "ac": 30, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Mustafa Erol Balkan", "ta": 30, "tc": 40}], "ce": 0, "p": 169}, "201902": {"c": "FIN 958", "n": "Global Financial Markets", "f": "SOM", "cr": 1.5, "ac": 38, "ca": 38, "pr": [], "co": [], "i": [{"tn": "Mustafa Erol Balkan", "ta": 38, "tc": 38}], "ce": 0, "p": 144}, "catList": ["This course is an introduction to the global financial markets that are used by banks, multinational corporations, and government agencies, in the conduct of their business and implementation of economic policy. The global financial markets include the market for foreign exchange, the Eurocurrency and related money markets, the international capital markets, the commodity markets and the markets for forward contracts, options, swaps and other derivatives. The course seeks to explain how these markets work both in the context of basic principles of economics and finance and by means of examples and applications using several case studies.  It will also look at a very important risk namely the exchange rate risk for multinational corporations, banks and other entities (hedge funds, shadow banks, etc.) and discuss how to manage and hedge these risks using various financial instruments. Finally the course will provide theoretical and empirical analysis on the prediction, prevention and management of various financial crisis, such as banking, currency, debt and balance of payments crises."]}