{"200402": {"c": "HART 521", "n": "Art in the Age of Revolt:Modernity", "f": "FASS", "cr": 3.0, "ac": 5, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Maryse Posenaer", "ta": 5, "tc": 10}], "ce": 0, "p": 229}, "200502": {"c": "HART 521", "n": "Art in the Age of Revolt:Modernity", "f": "FASS", "cr": 3.0, "ac": 2, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Maryse Posenaer", "ta": 2, "tc": 10}], "ce": 0, "p": 330}, "200902": {"c": "HART 521", "n": "Art in the Age of Revolt:Modernity", "f": "FASS", "cr": 3.0, "ac": 1, "ca": 20, "pr": ["HART 411"], "co": [], "i": [{"tn": "Maryse Posenaer", "ta": 1, "tc": 20}], "ce": 0, "p": 430}, "201102": {"c": "HART 521", "n": "Art in the age of Revolt: Early Modernity", "f": "FASS", "cr": 3.0, "ac": 1, "ca": 10, "pr": ["HART 411"], "co": [], "i": [{"tn": "Maryse Posenaer", "ta": 1, "tc": 10}], "ce": 1, "p": 438}, "201302": {"c": "HART 521", "n": "Art in the age of Revolt: Early Modernity", "f": "FASS", "cr": 3.0, "ac": 1, "ca": 10, "pr": ["HART 411"], "co": [], "i": [{"tn": "Maryse Posenaer", "ta": 1, "tc": 10}], "ce": 1, "p": 435}, "catList": ["This course aims to consider what has counted as modern in art since the advent of the avant-garde in Europe in the mid-nineteenth century. The changing relations between notions of modernity and the aims of artists and their works will be reviewed. The significance of movements in art, such as realism and impressionism, cubism and futurism, may be assessed. Students may expect to consider works by Courbet, Manet, Monet, Cézanne, Picasso, Braque, Matisse, Malevich, Mondrian, Duchamp. Notions of modernism in art will be examined as part of a consideration of the aims of modern art, social, political or otherwise.", "This course aims to consider what has counted as modern in art since --and before-- the advent of the avant-garde in Europe in the mid-nineteenth century. The changing relations between notions of modernity and the aims of artists and their works is reviewed. The significance of movements in art, such as romanticism, realism, impressionism, and post-impressionism, towards the development of `modern art' is assessed. Students may expect to consider works by key artists such as Delacroix, Ingres, Turner, Constable, Courbet, Manet, Monet, Cezanne, Gauguin, Seurat, Van Gogh. Notions of modernity and modernism in art will be examined as part of a consideration of the aims of modern art, social, political or otherwise."]}