{"200503": {"c": "ITM 541", "n": "IT Project Management", "f": "SOM", "cr": 3.0, "ac": 8, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Muhittin Oral", "ta": 8, "tc": 15}], "ce": 0, "p": 43}, "200602": {"c": "ITM 541", "n": "IT Project Management", "f": "SOM", "cr": 3.0, "ac": 8, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Muhittin Oral", "ta": 8, "tc": 12}], "ce": 0, "p": 244}, "200702": {"c": "ITM 541", "n": "IT Project Management", "f": "SOM", "cr": 3.0, "ac": 12, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Muhittin Oral", "ta": 12, "tc": 12}], "ce": 0, "p": 194}, "200802": {"c": "ITM 541", "n": "IT Project Management", "f": "SOM", "cr": 3.0, "ac": 5, "ca": 8, "pr": [], "co": [], "i": [{"tn": "Muhittin Oral", "ta": 5, "tc": 8}], "ce": 1, "p": 314}, "200901": {"c": "ITM 541", "n": "IT Project Management", "f": "SOM", "cr": 3.0, "ac": 1, "ca": 1, "pr": [], "co": [], "i": [{"tn": "Muhittin Oral", "ta": 1, "tc": 1}], "ce": 1, "p": 449}, "catList": ["Overview of project management principles and lifecycle; IT Project definition, roles and responsibilities; Resource and capacity planning for IT projects; Computer-aided tools for project management; Risk and expectation management; Success and horror stories in IT Project Management and implementation management in IT projects.", "The objectives of this course are three fold. First, it is essential that the ITM participants need to know how to conceptualize and conduct projects, particularly IT projects. To achieve this objective, a conceptual framework reflecting the very philosophy of doing business in a globalized competitive environment will be provided. Second, it is of essence that the ITM participants need to possess certain concepts and tools of project management in order to effectively execute IT projects in their own professional lives. This objective is to be achieved through studying the methods and issues of project management in connection with the first objective stated above.  Third, it is important that ITM participants should have a project experience in this course. For this purpose, the ITM participants are required to do a decision support project, individually, in alignment with the first and second objectives previously stated. Moreover, a conceptual framework for this purpose will be given as a support for ITM 591 - Project Proposal."]}