{"201203": {"c": "IT 567", "n": "ITIL (Information Technology Infrastructure Library) and IT Management", "f": "FENS", "cr": 3.0, "ac": 18, "ca": 33, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 18, "tc": 33}], "ce": 0, "p": 42}, "201303": {"c": "IT 567", "n": "ITIL (Information Technology Infrastructure Library) and IT Management", "f": "FENS", "cr": 3.0, "ac": 16, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Erman Taşkın", "ta": 16, "tc": 30}], "ce": 0, "p": 51}, "catList": ["ITIL (Information Technology Infrastructure Library) is the most widely adopted approach for IT Service Management and has been used as a de facto standard by the IT industry since 1980 for IT Management, IT Service Management and IT Infrastructure management. ITIL advocates that IT services must be aligned to the needs of the business and underpin the core business processes. It provides guidance to organizations on how to use IT as a tool to facilitate business change, transformation and growth. The ITIL best practices are currently detailed within 5 core publications which map the entire ITIL Service Lifecycle. These publications are Service Strategy, Service Design, Service Transition, Service Operation and Continual Service Improvement. Lectures will cover practical applications, case studies, software and real market projects that depend on theoretical IT management processes. Every week there will be a presentation session  for real-life cases and industrial/enterprise software applications. Students will have the opportunity to thoroughly learn the 26 processes of ITIL listed in the core publications. There will be presentations for each session based on the product family of BMC and Manage Engine software. Course will be aligned with the accredited syllabus and concepts of ITIL. Core publications will be summarized and mapped onto the leraning objectives of the international ITIL certificate. By the end of this class, students will be ready to take the exam to be ITIL Foundation certified if they desire to do so."]}