{"201002": {"c": "VA 453", "n": "Design, Object, Pulsations", "f": "FASS", "cr": 3.0, "ac": 2, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Selçuk Halil Gürışık", "ta": 2, "tc": 15}], "ce": 0, "p": 428}, "201601": {"c": "VA 453", "n": "Design Thinking", "f": "FASS", "cr": 3.0, "ac": 14, "ca": 16, "pr": ["VA 553"], "co": [], "i": [{"tn": "Gözde Oral", "ta": 14, "tc": 16}], "ce": 1, "p": 281}, "201701": {"c": "VA 453", "n": "Design Thinking", "f": "FASS", "cr": 3.0, "ac": 17, "ca": 17, "pr": ["VA 553"], "co": [], "i": [{"tn": "Gözde Oral", "ta": 17, "tc": 17}], "ce": 1, "p": 227}, "201801": {"c": "VA 453", "n": "Design Thinking", "f": "FASS", "cr": 3.0, "ac": 8, "ca": 17, "pr": ["VA 553"], "co": [], "i": [{"tn": "Gözde Oral", "ta": 8, "tc": 17}], "ce": 2, "p": 347}, "201901": {"c": "VA 453", "n": "Design Thinking", "f": "FASS", "cr": 3.0, "ac": 1, "ca": 10, "pr": ["VA 553"], "co": [], "i": [{"tn": "Gözde Oral", "ta": 1, "tc": 10}], "ce": 2, "p": 492}, "202001": {"c": "VA 453", "n": "Design Thinking", "f": "FASS", "cr": 3.0, "ac": 10, "ca": 11, "pr": ["VA 553"], "co": [], "i": [{"tn": "Gözde Oral", "ta": 10, "tc": 11}], "ce": 2, "p": 336}, "catList": ["This theory related practice based course focuses on object and culture relationships based on reciprocal perceptions of social products and their `Visible and Invisible Qualities' and `Values'. The comparative evaluations of the design elements will be related to various `cultural loci' of the products. The critical analysis will be rooted in the differentiations between `objets d'art', `culture-objects' and `design objects' through deconstructed reciprocities that assist students in developing and understanding socio-cultural evolutions within a `tradition to contemporary' framework. The course assists students in the process of decoding Fashion & Textile and Wearable-Art in terms of cultural identities within a regional and global context that facilitates a realization of the individual's outcomes through personal input in terms of evolutional art-&-design activities.", "Today design lies at the crossroads of culture, technology, society, environment and business. We live in increasingly visual, design-conscious environments, from our cities and public spaces to our homes and offices, from cultural institutions and entertainment venues to parks and new urban developments. From objects, gadgets, advertising, websites, social media, printed matter and magazines to trends in fashion, food, music, hair styles and tattoos \"design\" is everywhere, almost a household term. Yet in spite of (and perhaps because of) this omnipresence, both as creators and as consumers of design, we sometimes hesitate to question, understand, constructively criticize and learn from what surrounds us. This course aims to encourage students to do so through observations, related readings, exercises and viewings. Students are expected to express their views, join discussions and contribute material to further develop their understanding and awareness of the thinking that goes into design.", "Today design lies at the crossroads of culture, technology, society, environment and business. This course aims to look at this unique intersection and the role of the 21st century designer not just as a \"creator\" but as a thinker, initiator, collaborator, entrepreneur. Design thinking methodologies are employed to generate creative ideation and students are expected to express their views, join discussions and contribute material to further develop their understanding and awareness of the thinking that goes into design."]}