{"200302": {"c": "LIT 359", "n": "Poetry, Ideology and Resistance", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Kelly Todd Brewer", "ta": 6, "tc": 20}], "ce": 0, "p": 202}, "201301": {"c": "LIT 359", "n": "Literature, Ideology and  Resistance", "f": "FASS", "cr": 3.0, "ac": 17, "ca": 18, "pr": ["LIT 559"], "co": [], "i": [{"tn": "Sibel Irzık", "ta": 17, "tc": 18}], "ce": 1, "p": 188}, "201901": {"c": "LIT 359", "n": "Literature, Ideology and  Resistance", "f": "FASS", "cr": 3.0, "ac": 20, "ca": 30, "pr": ["LIT 559"], "co": [], "i": [{"tn": "Sibel Irzık", "ta": 20, "tc": 30}], "ce": 1, "p": 236}, "catList": ["This course focuses on some of the major literary figures of the Atlantic responsible for innovating poetry's political role in society and redefining the responsibility of artists and critics in the twentieth century. The euphoria created by the struggles against colonization and racial and class oppression in various parts of the world led artists to reevaluate the political possibilities of poetry. Our study of a group of poets writing in the first half of the twentieth century at the nexus of these struggles will incorporate a critical dialogue on cultural studies. To this end, we will pay attention to theoretical debates on how culture, ideology, 'race', ethnicity and class have been defined and/or represented. We will focus on (English-, Spanish- and French-speaking) poets of the Atlantic; nevertheless one of the aims of the course is to equip the student with the conceptual tools to analyze a variety of literary texts with respect to politics, ideology and resistance.", "This course focuses on some of the major literary figures responsible for innovating literature's political role in society and redefining the responsibility of artists and critics in the twentieth century. The euphoria created by the struggles against colonization and racial and class oppression in various parts of the world led artists to reevaluate the political possibilities of literature. The study of a group of writers at the nexus of these struggles will incorporate a critical dialogue on cultural studies. Accordingly, the course puts the emphasis on the theoretical debates on how culture, ideology, 'race', ethnicity and class have been defined and/or represented. An important learning outcome is to equip the student with the conceptual tools to analyze a variety of literary texts with respect to politics, ideology and resistance"]}