{"201902": {"c": "ENS 309", "n": "Computer Aided Engineering", "f": "FENS", "cr": 3.0, "ac": 17, "ca": 50, "pr": ["ENS 209", "IE 309"], "co": ["ENS 309L"], "i": [{"tn": "Eralp Demir", "ta": 17, "tc": 50}], "ce": 0, "p": 261}, "202001": {"c": "ENS 309", "n": "Computer Aided Engineering", "f": "FENS", "cr": 3.0, "ac": 14, "ca": 50, "pr": ["ENS 209", "IE 309"], "co": ["ENS 309L", "ENS 309R"], "i": [{"tn": "Eralp Demir", "ta": 14, "tc": 50}], "ce": 0, "p": 294}, "catList": ["The proposed course, Computer Aided Engineering (CAE), intends to give engineering students a computer design perspective considering manufacturing limitations. The emphasis of the course is on engineering applications and the use of a commercially available engineering software. Design applications include analysis in different physical fields such as solid mechanics, thermal, and fluid mechanics. Solidworks software environment will be used intensely throughout the class to be consistent with the Computer Aided Design (CAD) and Computer Aided Manufacturing (CAM) courses The vast majority of the course includes design applications by giving brief reference to theoretical background. First, basic concepts of a finite element model, mesh, nodes, elements, adaptive meshing will be described in a simplified manner with applications. The mechanical analysis section includes background information such as mechanical equilibrium, stress, strain, material properties. Static mechanical design applications include static analysis of parts and assemblies, stress analyses of interference fits, bolted joints, and contact analysis Dynamic mechanical analyses cover the definition of rigid and elastic bodies, discrete & distributed vibration systems, modal analysis, time response analysis (resonance, beating, etc.), and harmonic response analysis, all concepts with applications. Thermal analysis section starts with the analogy between the mechanical and thermal analysis by giving reference to concepts like energy balance, steady-state and transient problems. Discussions include definition of thermal loads, boundary conditions. Heat transfer applications include problems involving conduction, convection, radiation. Thermal section concludes with the thermomechanical applications that couple mechanical and thermal physics. Fluid analysis section starts with the introduction of properties such as density, viscosity, etc. with the continuity and balance laws. Definition of thermal loads, boundary conditions will be discussed with applications. Example analysis include flow through cylinders, cut-outs etc. Thermofluid application will be discussed for piping design applications. Moreover, design optimization will also be discussed for engineering design applications. Finally, designs for manufacturing  and relevant concepts i.e. geometrical dimensioning and tolerancing will be discussed."]}