{"200602": {"c": "MRES 603", "n": "Probability and Statistics", "f": "SOM", "cr": 3.0, "ac": 3, "ca": 4, "pr": [], "co": [], "i": [{"tn": "Fırat İnceoğlu", "ta": 3, "tc": 4}], "ce": 0, "p": 331}, "200801": {"c": "MRES 603", "n": "Probability and Statistics", "f": "SOM", "cr": 3.0, "ac": 4, "ca": 6, "pr": [], "co": [], "i": [{"tn": "Fırat İnceoğlu", "ta": 4, "tc": 6}], "ce": 1, "p": 354}, "catList": ["This course covers the fundamental concepts for probability and statistics. In the first part of the course, the focus is on concepts including random variables, probability distributions, specific discrete and continuous distributions and their applications, expected values and conditional probability. This is followed by a review of the central limit theorem and the law of large numbers. After these fundamental topics are covered, the focus shifts to statistics and the use of statistics principles in different contexts. Topics such as sampling distributions, point and interval estimates, confidence intervals, hypothesis testing, parametric and non-parametric tests, analysis of variance and linear regression are presented. Throughout the course of the semester, students get to use a common statistics package such as SPSS on various problems under each major topic of the course. (Knowledge of Calculus is recommended)", "This course covers the fundamental concepts for probability and statistics. In the first part of the course, the focus is on concepts including random variables, probability distributions, specific discrete and continuous distributions and their applications, expected values and conditional probability. This is followed by a review of the central limit theorem and the law of large numbers. After these fundamental topics are covered, the focus shifts to statistics and the use of statistics principles in different contexts. Topics such as sampling distributions, point and interval estimates, confidence intervals, hypothesis testing, parametric and non-parametric tests, analysis of variance and linear regression are presented. (Knowledge of Calculus is recommended)"]}