{"200301": {"c": "HIST 455", "n": "History of the Balkan Lands up to  the Early 19th century and the Onset  of Tanzimat Modernization:", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Rossitsa Stefanova Gradeva", "ta": 3, "tc": 15}], "ce": 0, "p": 245}, "catList": ["This course is designed to introduce undergraduate students with some initial knowledge of key Ottoman institutions, to the pre-modern history of the Balkan peoples during the Ottoman centuries. But it may also provide useful backgrounding for graduate students interested in focusing on Modern Balkan History, or on Late Ottoman and Modern Turkish History complemented by a comparative knowledge of modern Balkan dimensions. The main themes to be dealt with may include : the Balkans as a region; the Balkans on the eve of the Ottoman conquest; the Ottoman expansion into southeast and then towards central Europe; the impact of the wars of Ottoman conquest on the Balkan peoples; establishing Ottoman authority in the Balkans : the specifics of the administration and status of the Balkan territories; questions of self- rule; administrative and judicial institutions in the Balkan provinces of the Ottoman empire; agrarian relations; towns and urban society; Islam in the Balkans; colonisation and Islamisation; the organisation of the religious and cultural life of non-Muslim Ottoman subjects; questions of communal status; the cultural life of the Balkan peoples during the 15th - 18th centuries; the Balkan provinces during the 18th and the early 19th centuries; the emergence of the Eastern Question; characteristic features of the Balkan Awakenings as a cultural and economic phenomenon - the Enlightenment and Romanticism, the genesis and specific features of Balkan capitalism, the Serbian Uprisings and the formation of the Serbian vassal principality; the Greek War of Independence and the formation of the Greek kingdom. Assessment will be based on a written paper and a final examination."]}