{"200203": {"c": "IT 571", "n": "Linux and Windows 2000 System Administration", "f": "FENS", "cr": 3.0, "ac": 14, "ca": 24, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 14, "tc": 24}], "ce": 0, "p": 15}, "200601": {"c": "IT 571", "n": "Linux and Windows System Administration", "f": "FENS", "cr": 3.0, "ac": 24, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Burak Keskin", "ta": 24, "tc": 30}], "ce": 1, "p": 122}, "200701": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 23, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Burak Keskin", "ta": 23, "tc": 30}], "ce": 2, "p": 132}, "200802": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 16, "ca": 29, "pr": [], "co": [], "i": [{"tn": "Emre Celalettin Sayın", "ta": 16, "tc": 29}], "ce": 2, "p": 174}, "200902": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 12, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Emre Celalettin Sayın", "ta": 12, "tc": 25}], "ce": 2, "p": 214}, "201002": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 9, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Emre Celalettin Sayın", "ta": 9, "tc": 15}], "ce": 2, "p": 248}, "201102": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 11, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Emre Celalettin Sayın", "ta": 11, "tc": 20}], "ce": 2, "p": 213}, "201203": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 14, "ca": 33, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 14, "tc": 33}], "ce": 2, "p": 56}, "201303": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 10, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Emre Celalettin Sayın", "ta": 10, "tc": 30}], "ce": 2, "p": 67}, "201403": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 18, "ca": 35, "pr": [], "co": [], "i": [{"tn": "Emre Celalettin Sayın", "ta": 18, "tc": 35}], "ce": 2, "p": 58}, "201503": {"c": "IT 571", "n": "Linux System Administration", "f": "FENS", "cr": 3.0, "ac": 16, "ca": 35, "pr": [], "co": [], "i": [{"tn": "Ahmet Demirelli", "ta": 16, "tc": 35}], "ce": 2, "p": 72}, "catList": ["This course provides the students with an understanding of how to install various Linux operating systems, undertake periodic and day-to-day system administration tasks. Topics covered include the system installation, how to boot up and shut down the system, maintaining disks, file system maintenance, reconfiguring the system kernel, adding maintenance, reconfiguring the system kernel, adding 541 covers Windows 2000 Server Administration. The student is introduced to the strengths and features of Win2000 Server. Among the topics covered are Win2000 Server Installation, user account setup and administration, file and print server setup, multiple servers and domain controllers, ault tolerant file system setup. Topics include Introduction to Linux; Installing Linux Operating System; Linux File System; Linux File Maintenance; Linux Security Administration; Linux System Reconfiguration; Adding Hardware to the Linux System; Debugging Linux; W2000 Server Overview; Installing W2000; NT RAID Systems for Fault Tolerance; Creating and Managing User Accounts; Creating and Managing Directory Shares; Performance Monitoring; Debugging W2000.", "This course provides the students with an understanding of how to install various Linux operating systems, undertake periodic and day-to-day system administration tasks. Topics covered include the system installation, how to boot up and shut down the system, maintaining disks, file system maintenance, reconfiguring the system kernel, adding 541 covers Windows 2000 Server Administration. The student is introduced to the strengths and features of Win2000 Server. Among the topics covered are Win2000 Server Installation, user account setup and administration, file and print server setup, multiple servers and domain controllers, ault tolerant file system setup. Topics include Introduction to Linux; Installing Linux Operating System; Linux File System; Linux File Maintenance; Linux Security Administration; Linux System Reconfiguration; Adding Hardware to the Linux System; Debugging Linux; W2000 Server Overview; Installing W2000; NT RAID Systems for Fault Tolerance; Creating and Managing User Accounts; Creating and Managing Directory Shares; Performance Monitoring; Debugging W2000.", "This course provides the students with an understanding of how to install various Linux operating systems and undertake periodic and day-to-day system administration tasks. Topics covered include the system installation, how to boot up and shut down the system, maintaining disks, file system maintenance, reconfiguring the system kernel, application/system file installation and updates, adding hardware to the Linux System, debugging Linux, creating and managing user accounts; creating and managing directory Shares with NFS and Samba servives; FTP and HTTP service configuration. Also Performance and security issues covered with SeLinux implementations take part in the course content"]}