{"200202": {"c": "HIST 363", "n": "Social and Economic History of the Ottoman Empire", "f": "FASS", "cr": 3.0, "ac": 11, "ca": 25, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Hülya Canbakal", "ta": 11, "tc": 25}], "ce": 0, "p": 113}, "200402": {"c": "HIST 363", "n": "Social and Economic History of the Ottoman Empire", "f": "FASS", "cr": 3.0, "ac": 19, "ca": 40, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Metin İbrahim Kunt", "ta": 19, "tc": 40}], "ce": 0, "p": 98}, "200502": {"c": "HIST 363", "n": "Social and Economic History of the Ottoman Empire", "f": "FASS", "cr": 3.0, "ac": 12, "ca": 40, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Metin İbrahim Kunt", "ta": 12, "tc": 40}], "ce": 0, "p": 165}, "200601": {"c": "HIST 363", "n": "Social and Economic History of the Ottoman Empire", "f": "FASS", "cr": 3.0, "ac": 10, "ca": 30, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Hülya Canbakal", "ta": 10, "tc": 30}], "ce": 0, "p": 221}, "catList": ["A glorious classical age followed by a period of perpetual stagnation and decline and eventually the process of westernization, which pulled the empire out of a state of chronic sclerosis. Contrary to this traditional, state-centered textbook account, the Ottoman Empire was a dynamic socio-political entity that shared many common characteristics with other early modern states and societies to its east and west state institutions, social and economic relations and hierarchies, tastes, modalities of religiosity etc, all underwent important transformations in the period before the 19th-century reforms. The course surveys these changes and continuities that characterize the social and economic life of the Ottoman peoples over 1300-1800. Issues to be covered include: land tenure; the organization of urban production, trade and credit relations; the challenge posed by the rise of the modern world system; social stratification; private and public lives; ethnic and religious diversity; intellectual life; popular culture and forms of popular protest; the mechanisms of social and political control; and relations between state and society."]}