{"200301": {"c": "IT 530", "n": "Advanced Web Programming", "f": "FENS", "cr": 3.0, "ac": 22, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 22, "tc": 25}], "ce": 0, "p": 71}, "200401": {"c": "IT 530", "n": "Advanced Web Programming", "f": "FENS", "cr": 3.0, "ac": 22, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 22, "tc": 40}], "ce": 0, "p": 91}, "200501": {"c": "IT 530", "n": "Advanced Web Programming", "f": "FENS", "cr": 3.0, "ac": 21, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Hasan Sait Ölmez", "ta": 21, "tc": 25}], "ce": 0, "p": 111}, "200602": {"c": "IT 530", "n": "Advanced Web Programming", "f": "FENS", "cr": 3.0, "ac": 21, "ca": 22, "pr": [], "co": [], "i": [{"tn": "Ahmet Demirelli", "ta": 21, "tc": 22}], "ce": 0, "p": 125}, "200801": {"c": "IT 530", "n": "Advanced Web Programming", "f": "FENS", "cr": 3.0, "ac": 19, "ca": 29, "pr": [], "co": [], "i": [{"tn": "Altuğ Tanaltay", "ta": 19, "tc": 29}], "ce": 0, "p": 159}, "catList": ["This course provides a formal introduction to Web application development and Web-enabled technologies. It also provides a grand tour of the technologies used on the client and server side to support user web interfaces This course, in short, provides the student with the skills needed to build professional web applications with interfaces to different types of databases. Programming, which is needed to interface the web pages with CGI and interface with database through ODBC, is usually done with interpreted languages like Perl, PHP, Python, etc. as compiled languages are already taught in other classes. This course also introduces the students to other methods of interfacing with a database, including Active Server Pages (ASP) and Java Server Pages. It finally summarizes the the competing technologies supporting distributed computing, COM/DCOM from Microsoft and Open Standard CORBA. Comparison between different technologies is essential to choosing the right solution for the business environment that is built."]}