{"201201": {"c": "VA 505", "n": "Research Methods in the Theory of Artistic Practice", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 9, "tc": 20}], "ce": 0, "p": 317}, "201301": {"c": "VA 505", "n": "Addressing Studio Creative Practice", "f": "FASS", "cr": 3.0, "ac": 7, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 7, "tc": 20}], "ce": 1, "p": 354}, "201401": {"c": "VA 505", "n": "Addressing Studio Creative Practice", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 9, "tc": 20}], "ce": 1, "p": 312}, "201501": {"c": "VA 505", "n": "Addressing Studio Creative Practice", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 9, "tc": 20}], "ce": 1, "p": 332}, "201601": {"c": "VA 505", "n": "Addressing Studio Creative Practice", "f": "FASS", "cr": 3.0, "ac": 8, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 8, "tc": 20}], "ce": 1, "p": 348}, "201701": {"c": "VA 505", "n": "Addressing Studio Creative Practice", "f": "FASS", "cr": 3.0, "ac": 10, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 10, "tc": 20}], "ce": 2, "p": 327}, "201801": {"c": "VA 505", "n": "Addressing Studio Creative Practice", "f": "FASS", "cr": 3.0, "ac": 7, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 7, "tc": 20}], "ce": 2, "p": 365}, "201901": {"c": "VA 505", "n": "Addressing Studio Creative Practice", "f": "FASS", "cr": 3.0, "ac": 11, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 11, "tc": 20}], "ce": 2, "p": 328}, "202001": {"c": "VA 505", "n": "Addressing Studio Creative Practice", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Elif Emine Ayiter", "ta": 9, "tc": 20}], "ce": 2, "p": 362}, "catList": ["This course aims to enable artists and designers to theorize and to write effectively on their own creative output and projects, as well as to give them the ability to conduct research and develop theory in wider related fields such as art theory, art criticism, art education, new media, curatorial studies and the like. Although the methodology of research of the theory of artistic practice can be seen to be a merger of qualitative inquiry, aesthetics and narratology; nevertheless given the oftentimes subjective nature of writing about one’s own projects creative output calls for additional approaches and tools, which also include the ability to put together a solid documentation of personal creative output as well as integrating such a documentation into both the text and the presentation /summation thereof.", "This course aims to enable artists and designers to  theorize and to write effectively on their own creative output and projects, as well as to give  them the ability to conduct research and develop  theory in wider related fields such as art theory, art criticism, art education, new media, curatorial studies  and the like. Although the methodology of  research of the theory of artistic practice can be seen to be a merger of qualitative inquiry, aesthetics and narratology; nevertheless given the oftentimes subjective nature  of writing about one’s own projects creative  output calls for additional approaches and tools, which also include the ability to put together a solid documentation of personal creative  as well as integrating such output a documentation into both the text and the presentation /summation thereof.", "This course aims to enable artists and designers to  theorize and to write effectively on their own creative output and projects, as well as to give  them the ability to conduct research, introduce research analysis and design and develop theory in wider related fields such as art theory, art criticism, art education, new media, curatorial studies  and the like. Although the methodology of research of the theory of artistic practice can be seen to be a merger of qualitative inquiry, aesthetics and narratology; nevertheless given the oftentimes subjective nature  of writing about one’s own projects creative  output calls for additional approaches and tools, which also include the ability to put together a solid documentation of personal creative  as well as integrating such an output into a documentation both as an academic text and the  presentation / summation thereof. The course also aims to expose students to ethical considerations in research and publishing."]}