{"200602": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Dilek Güven", "ta": 9, "tc": 10}], "ce": 0, "p": 230}, "200702": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 11, "ca": 11, "pr": ["SPS 485"], "co": [], "i": [{"tn": "Dilek Güven", "ta": 11, "tc": 11}], "ce": 1, "p": 211}, "200801": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 8, "ca": 15, "pr": ["HIST 485"], "co": [], "i": [{"tn": "Fikret Adanır", "ta": 8, "tc": 15}], "ce": 1, "p": 267}, "201202": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 5, "ca": 15, "pr": ["HIST 485"], "co": [], "i": [{"tn": "Fikret Adanır", "ta": 5, "tc": 15}], "ce": 1, "p": 362}, "201401": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 11, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Ayşe Ozil", "ta": 11, "tc": 15}], "ce": 1, "p": 284}, "201501": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 12, "ca": 19, "pr": [], "co": [], "i": [{"tn": "Ayşe Ozil", "ta": 12, "tc": 19}], "ce": 1, "p": 297}, "201603": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 3, "ca": 15, "pr": ["HIST 485"], "co": [], "i": [{"tn": "Ayşe Ozil", "ta": 3, "tc": 15}], "ce": 1, "p": 66}, "201702": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 20, "pr": ["HIST 485"], "co": [], "i": [{"tn": "Ayşe Ozil", "ta": 6, "tc": 20}], "ce": 1, "p": 391}, "201802": {"c": "HIST 585", "n": "Minority Questions in Contemporary Turkey", "f": "FASS", "cr": 3.0, "ac": 5, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Ayşe Ozil", "ta": 5, "tc": 15}], "ce": 1, "p": 409}, "catList": ["First decolonization and then the end of the Cold War have led to new waves of transnational movement. Mass immigration and floods of refugees have given rise to economic, social and cultural clashes, feeding into fresh problems of ethno-religious otherization that have come to haunt even the normally most stable and tolerant democracies of Europe. Simultaneously, Turkey's EU process is bringing into question a number of minority issues that are the legacy of the transition from the multi-ethnic Ottoman empire into Balkan, Caucasian and Middle Eastern nation-states. What are these questions? Which groups are involved? How can cultural, linguistic and religious rights be applied to the relationship between majority and minority groups at the national and international levels? How can consciousness of ethnic, religious or cultural diversity be fostered and promoted as a common value? It is to such historical and contemporary problems that HIST 585 is addressed. For the possibility of taking this course at an undergraduate level, subject to appropriate adjustments, see SPS 485.", "First decolonization and then the end of the Cold War have led to new waves of transnational movement. Mass immigration and floods of refugees have given rise to economic, social and cultural clashes, feeding into fresh problems of ethno-religious otherization that have come to haunt even the normally most stable and tolerant democracies of Europe. Simultaneously, Turkey's EU process is bringing into question a number of minority issues that are the legacy of the transition from the multi-ethnic Ottoman empire into Balkan, Caucasian and Middle Eastern nation-states. What are these questions ? Which groups are involved ? How can cultural, linguistic and religious rights be applied to the relationship between majority and minority groups at the national and international levels ? How can consciousness of ethnic, religious or cultural diversity be fostered and promoted as a common value ? It is to such historical and contemporary problems that HIST 585 is addressed. For the possibility of taking this course at an undergraduate level, subject to appropriate adjustments, see SPS 485."]}