{"200801": {"c": "EE 628", "n": "Force Control and Bilateral Teleoperation", "f": "FENS", "cr": 3.0, "ac": 12, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Volkan Patoğlu", "ta": 12, "tc": 15}], "ce": 0, "p": 219}, "201401": {"c": "EE 628", "n": "Force Control and Bilateral Teleoperation", "f": "FENS", "cr": 3.0, "ac": 6, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Volkan Patoğlu", "ta": 6, "tc": 12}], "ce": 0, "p": 362}, "201601": {"c": "EE 628", "n": "Force Control and Bilateral Teleoperation", "f": "FENS", "cr": 3.0, "ac": 6, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Volkan Patoğlu", "ta": 6, "tc": 15}], "ce": 0, "p": 381}, "201801": {"c": "EE 628", "n": "Force Control and Bilateral Teleoperation", "f": "FENS", "cr": 3.0, "ac": 11, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Volkan Patoğlu", "ta": 11, "tc": 15}], "ce": 0, "p": 296}, "202001": {"c": "EE 628", "n": "Force Control and Bilateral Teleoperation", "f": "FENS", "cr": 3.0, "ac": 5, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Volkan Patoğlu", "ta": 5, "tc": 15}], "ce": 0, "p": 430}, "catList": ["This course is designed to equip students with fundamental theories and computational methodologies that are used in (computer aided) analysis and synthesis of force controlled and bilaterally teleoperated systems. By the end of the course a solid understanding of the principles of force/bilateral control in the context of modern classical control and hands on experience with implementation of force/bilateral controllers on force feedback devices are aimed. Covered topics include fundamental limitations of feedback control, explicit force control, implicit force control, impedance control, admittance control, reaction force observers, scaled teleoperation architectures, trade-off between robust stability and transperancy, physics based simulation of virtual environments, haptics rendering, passivity of the human-in-the-loop sampled data system, destabilizing effects of communication/computation delays and approaches to compensate for these time delays, namely, time domain passivity and wave variable approaches. The course is appropriate for students in any engineering discipline with interests in robotics, nonlinear controls, and haptics."]}