{"200501": {"c": "ITM 533", "n": "Human Organization and Technology Management", "f": "SOM", "cr": 3.0, "ac": 8, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Deniz Tunçalp", "ta": 8, "tc": 12}], "ce": 0, "p": 223}, "200601": {"c": "ITM 533", "n": "Human Organization and Technology Management", "f": "SOM", "cr": 3.0, "ac": 11, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Dilek Çetindamar", "ta": 11, "tc": 25}], "ce": 0, "p": 206}, "200701": {"c": "ITM 533", "n": "Human Organization and Technology Management", "f": "SOM", "cr": 3.0, "ac": 12, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Mahmut Bayazıt", "ta": 12, "tc": 20}], "ce": 0, "p": 197}, "200802": {"c": "ITM 533", "n": "Managing Human Relations", "f": "SOM", "cr": 1.5, "ac": 6, "ca": 8, "pr": [], "co": [], "i": [{"tn": "Arzu Syeda Wasti", "ta": 6, "tc": 8}], "ce": 1, "p": 296}, "catList": ["This course is focused on key concepts, models, and methods that enable managers to effectively manage the development and utilization of technologies. The goal is to develop an awareness of the range, scope, and complexity of the phenomena, issues, and problems related to economics and management of technology and technological innovations. Main topics of the course include industrial structure and policy, concept of strategy and strategy alternatives, the process of technology strategy formulation, evaluation implementation and global visions for product and technology development. Another main element of this course is the human aspect of technology management and implementations, impacts on organizational culture and change management.", "This course addresses the management of human-IT interactions in an organization. In particular, the topics covered include: individual differences (gender, ability and attitudes) and technology use; motivating people dealing with IT; effective organizational communication for results (including the dissemination and utilization of information and knowledge); IT project teams, their formation, development and performance evaluation; interpersonal relationships, managing cooperation and conflict in relations with internal customers; leadership in technology change and adaptation; organizational structure and IT."]}