{"202001": {"c": "BIO 58005", "n": "Special Topics in BIO: Systems and Integrative Biology", "f": "FENS", "cr": 3.0, "ac": 20, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Christopher Mayack", "ta": 20, "tc": 30}], "ce": 0, "p": 224}, "catList": ["Students will take part in the following sections of this course 1)Literature survey to gain more background knowledge: this aims to introduce the students from a range of backgrounds in the biological and physical sciences, mathematics, computer science, and engineering to the basic concepts and theories behind Integrative and Systems Biology. 2)An introduction to integrative data collection and analysis: this section will cover experimental design and analysis and then use actual datasets previously collected from integrative biology experiments to explore the various analytical tools for integrating ‘omics’ approaches (transcriptomics, proteomics and and metabolomics), to arrive at testing a hypothesis. This section will emphasize the pros and cons of dealing with large amounts of data. 3)Systems engineering and mathematical modelling approaches: this section of the course will involve computer -based network modelling and a systems engineering framework required for studying a multifactorial complex problem. Students will embody tools of mathematics, informatics and statistics. 4)Wetlab experimental tools used in integrative biology: the molecular and cellular tools commonly used to integrate across behavioral, physiological, and neurological levels will be introduced. Students will have to devise their own experimental design to test a novel hypothesis generated on their own that will enhance their current thesis work. This section will include possible practical work if it is deemed feasible and results obtained will be presented orally by the end of the course. In addition to the above sections which incorporate lectures and practical classes, students will be required to carry out an independent research project of their own, applying what they have learned in class."]}