{"200501": {"c": "ITM 531", "n": "Business Process Modeling", "f": "SOM", "cr": 3.0, "ac": 8, "ca": 12, "pr": [], "co": [], "i": [{"tn": "Fatma Tevhide Altekin", "ta": 8, "tc": 12}], "ce": 0, "p": 223}, "200601": {"c": "ITM 531", "n": "Business Process Modeling", "f": "SOM", "cr": 3.0, "ac": 11, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Ahmet Refik Güllü", "ta": 11, "tc": 25}], "ce": 0, "p": 206}, "200701": {"c": "ITM 531", "n": "Business Process Modeling", "f": "SOM", "cr": 3.0, "ac": 12, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Fatma Tevhide Altekin", "ta": 12, "tc": 20}], "ce": 0, "p": 197}, "200801": {"c": "ITM 531", "n": "Business Process Modeling", "f": "SOM", "cr": 1.5, "ac": 7, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Muhittin Oral", "ta": 7, "tc": 20}], "ce": 1, "p": 286}, "catList": ["This course presents the concepts and tools required for modeling business processes. First the conceptual framework for business process design is introduced, followed by methods that can be used to decompose and analyze a business process as well as performance measures for evaluating efficiency of process models. Students get to use computer-based tools to design, re-design and edit business process models. The last part of the course covers event-based simulation concepts and tools for analyzing new business processes.", "Today one of the top ITM business priorities is business process improvement. This course starts by introducing the concepts and tools required for modeling business processes, which include a conceptual framework for business process design, methods that can be used to efficiency of process models. Students get to use decompose and analyze a business process, and performance measures for evaluating efficiency and effectiveness of process models. The second part of the course covers analysis of the recursive relationship between IT capabilities and business process design and re-design. This part involves studying the way IT can support business processes and how business processes can be transformed using IT. The ultimate goal is thus to convey the knowledge and skills necessary to assess and adapt information technologies to existing business processes and administer IT-based business transformation."]}