{"200102": {"c": "HIST 341", "n": "War and Society 2:The Military Revolution and the Genes. of the Modern State", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Halil Berktay", "ta": 4, "tc": 30}], "ce": 0, "p": 139}, "catList": ["This is the second in a series of five \"period\" courses revolving around the general theme of the social roots and determinants of warfare, and the impact of war on society. The series as a whole is designed to contribute to both the war-and-peace and the state-formation and state-theory dimensions of the SPS degree program, while this course in particular focuses on the second major threshold problematized by the new military history: the European development and crystallization of the modern state readings, ranging from Geoffrey Parker and Michael Howard, to Gabor Agoston and Rhoads Murphey, draw heavily on Charles Tilly's notion of \"war-making and state-making as organized crime\", as well as the literature on the \"military revolution\", which is seen as a new way of organizing fighting with gunpowder weapons. Crucial in this regard was the invention of a close-order infantry drill, though developments in siege and naval warfare were also important. This then impacts in all directions, transforming warriors into soldiers in order to effect one of the greatest homogenizations of modernity: armies in uniform, bearing standardized weapons, using standardized ammunition and undergoing constant training in order to achieve clockwork precision in carrying out standardized commands - the same kind of mechanical precision that was overtaking the sphere of production through the division of labour in Adam Smith's manufactories. It also engendered enormous costs, forcing state apparatuses into functional specialization, bureaucratization, and the creation of national tax systems in order to pay for the supply lines and systems required by modern warfare. There were social consequences (in the form of process analysis); also existential consequences for non-European societies, including the Ottomans, who like a few other pre-modern empires were faced with the-do-or-die question of \"importing the European army.\""]}