{"201302": {"c": "ETM 508", "n": "Finance of Energy Projects", "f": "FENS", "cr": 3.0, "ac": 11, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Mehmet Kerim Gökay", "ta": 11, "tc": 25}], "ce": 0, "p": 233}, "201402": {"c": "ETM 508", "n": "Finance of Energy Projects", "f": "FENS", "cr": 3.0, "ac": 25, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Mehmet Kerim Gökay", "ta": 25, "tc": 30}], "ce": 0, "p": 135}, "201502": {"c": "ETM 508", "n": "Finance of Energy Projects", "f": "FENS", "cr": 3.0, "ac": 21, "ca": 35, "pr": [], "co": [], "i": [{"tn": "Mehmet Kerim Gökay", "ta": 21, "tc": 35}], "ce": 0, "p": 179}, "201602": {"c": "ETM 508", "n": "Finance of Energy Projects", "f": "FENS", "cr": 3.0, "ac": 17, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 17, "tc": 30}], "ce": 0, "p": 232}, "201702": {"c": "ETM 508", "n": "Finance of Energy Projects", "f": "FENS", "cr": 3.0, "ac": 15, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Cavit Umut Ekmekçi", "ta": 15, "tc": 25}], "ce": 0, "p": 268}, "201802": {"c": "ETM 508", "n": "Finance of Energy Projects", "f": "FENS", "cr": 3.0, "ac": 14, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Özlem Kıldır", "ta": 14, "tc": 30}], "ce": 1, "p": 274}, "catList": ["The course will provide an in-depth understanding of energy finance by addressing three areas of finance in an energy framework: pricing, asset valuation and risk  management. The course begins by placing energy markets in the context of global financial markets and will develop  understanding of the energy markets and how to model and forecast energy and forward/future prices for hedging and risk management strategies. The course will also consider valuation and the various financing alternatives for energy projects using case studies.", "Energy Financing methodologies centered around corporate finance and project finance is the focal point of the course. Up-to-date and international practices of energy financing, based on energy sources, type of projects, energy market structures and financing structures are explained. Risk management, financial structuring, financial product selection and pricing specialized for energy project and market needs are shared.  Energy financing cases for both energy production & distribution in conventional & renewable energy from Turkey and abroad are studied, finance models, project risk matrices and project mapping are prepared in case studies. The course provides both profound theoretical knowledge and experience sharing uplifted with case studies and energy finance professionals as guest speakers."]}