{"200401": {"c": "MRES 601", "n": "Research Methods", "f": "SOM", "cr": 3.0, "ac": 3, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Arzu Syeda Wasti", "ta": 3, "tc": 5}], "ce": 0, "p": 273}, "200501": {"c": "MRES 601", "n": "Research Methods", "f": "SOM", "cr": 3.0, "ac": 3, "ca": 3, "pr": [], "co": [], "i": [{"tn": "Arzu Syeda Wasti", "ta": 3, "tc": 3}], "ce": 0, "p": 307}, "200901": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 6, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Özgecan Koçak", "ta": 6, "tc": 10}], "ce": 1, "p": 342}, "201002": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 5, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Özgecan Koçak", "ta": 5, "tc": 5}], "ce": 1, "p": 332}, "201301": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 3, "ca": 5, "pr": ["MRES 503"], "co": [], "i": [{"tn": "Özgecan Koçak", "ta": 3, "tc": 5}], "ce": 1, "p": 441}, "201401": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 2, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Özgecan Koçak", "ta": 2, "tc": 5}], "ce": 1, "p": 438}, "201601": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 2, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Özgecan Koçak", "ta": 2, "tc": 10}], "ce": 1, "p": 439}, "201602": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 4, "ca": 4, "pr": [], "co": [], "i": [{"tn": "Remzi Gözübüyük", "ta": 4, "tc": 4}], "ce": 2, "p": 403}, "201702": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 2, "ca": 5, "pr": [], "co": [], "i": [{"tn": "Yiğit Atılgan", "ta": 2, "tc": 5}], "ce": 2, "p": 479}, "201901": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 9, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Arzu Syeda Wasti", "ta": 9, "tc": 10}], "ce": 2, "p": 355}, "201902": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 1, "ca": 1, "pr": [], "co": [], "i": [{"tn": "Melek Akın Ateş", "ta": 1, "tc": 1}], "ce": 2, "p": 511}, "202001": {"c": "MRES 601", "n": "Research Methods in Management and Organization Studies", "f": "SOM", "cr": 3.0, "ac": 2, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Arzu Syeda Wasti", "ta": 2, "tc": 15}], "ce": 2, "p": 488}, "catList": ["As an introduction to research in social sciences, this course is based on the scientific method of inquiry and provides a critical appraisal of the various research methods available to social scientists following the natural science paradigm. It aims to familiarize students with the procss of identifying a research question, formulation of hypotheses or predictions about the question, designing a study to test the hypotheses, observing or measuring variables, examining the relationships between variables observed, and drawing conclusions about the research question based on observed relationships. Topics to be covered include a discussion of measurement issues such as reliability and validity, common threats to validity in research desgn, decisions regarding the choice of samples and settings, and the relative advantages and disadvantages of various emprical research strategies.", "As an introduction to research in management and As an introduction to research in management and the scientific method of inquiry and provides a critical appraisal of the various research methods available to organizational scholars following the natural science paradigm. It aims to familiarize students with the process of identifying a research question, formulation of hypotheses or predictions about the question, designing a study to test the hypotheses, observing or measuring variables, examining the relationships between variables observed, and drawing conclusions about the research question based on observed relationships. Topics to be covered include a discussion of measurement issues such as reliability and validity, common threats to validity in research design, decisions regarding the choice of samples and settings, and the relative advantages and disadvantages of various empirical research strategies. To support the course content, , examples of management and organization research are critically analyzed and students are expected to develop their own research proposal by the end of the semester.", "This PhD seminar provides a foundation for theory building and empirical analysis in the study of organizations. Rather than focus on particular statistical or analytical methods, the goal is to provide participants with a rigorous grounding in the scientific approach to constructing theoretical arguments and designing appropriate empirical tests. The course is organized around the question of how to do good research. Topics to be covered include common threats to validity in research design, decisions regarding the choice  of samples and settings, measurement issues such as reliability and validity, estimation methods, data collection tools, and ethics in planning, conduct, and publication of research. The seminar thus serves as a complement to other basic and advanced research method courses, and will develop skills needed to: 1.   build and analyze theoretical arguments 2.   design effective tests of theory 3.   understand  the interplay between theory building and theory testing Students will get some experience critiquing the methodology used in published studies and hopefully develop some idea about how to start conducting their own dissertation research."]}