{"201702": {"c": "MGMT 930", "n": "Corporate Strategy", "f": "SOM", "cr": 1.5, "ac": 28, "ca": 50, "pr": [], "co": [], "i": [{"tn": "Kimio Kase", "ta": 28, "tc": 50}], "ce": 0, "p": 170}, "catList": ["Business policy is the study of the functions and responsibilities of senior management, the crucial problem that affect success in the total enterprise, and the decisions that determine the direction of the organisation and shape its future. The problem of policy in business, like those of policy in public affairs, have to do with the choice of purpose, the definition and recognition of organisational identity and character, the continuous definition of what needs to be done, and the mobilisation of resources for the attainment of goals in the face of competition or adverse circumstance, and the definition of standards for the enforcement of responsible and ethical behaviour. The central theme of business policy is the strategy of the enterprise. Strategy is the determination of long term goals and objectives of an enterprise, and the adoption of courses of action and the allocation of resources necessary for carrying out these goals. Managing the policy or strategy of an enterprise is normally referred to as strategic management. Strategy is concerned with tow central questions: “What business should we be in?” and “ How should we compete?”. Because competition from rival firms is the dominant feature of the business environment of most enterprises, we will be particularly concerned with the latter question. A major part of the course will explore how a firm can establish a sustainable advantage within its chosen area of business. Our perspective is that of the general manager. The general manager may be a corporate president, a divisional chief executive, the head of an operating unit, or an owner-proprietor. However, this course is not only relevant to future general managers. An appreciation of the organisation’s overall strategy is essential for functional specialists if they are successfully to co-ordinate their activities with the overall needs of the business. The approach of the course is practical and problem -oriented. The major part of the course will involve applying concepts, analytic frameworks, and intuition to the strategic issues which real-world companies face. Most of the theory and concepts uses will be drawn from other disciplines, especially economics, finance,  accounting, marketing and organisation theory."]}