{"201601": {"c": "TLL 530", "n": "Intermediate Ottoman Turkish I", "f": "SL", "cr": 3.0, "ac": 6, "ca": 10, "pr": ["TLL 520", "TLL 520", "TLL 502", "TLL 502"], "co": ["TLL 530D"], "i": [{"tn": "Sevim Yılmaz Önder", "ta": 6, "tc": 10}], "ce": 0, "p": 381}, "201702": {"c": "TLL 530", "n": "Intermediate Ottoman Turkish I", "f": "SL", "cr": 3.0, "ac": 3, "ca": 5, "pr": ["TLL 520", "TLL 520", "TLL 502", "TLL 502"], "co": ["TLL 530D"], "i": [{"tn": "Bahadır Sürelli", "ta": 3, "tc": 5}], "ce": 0, "p": 454}, "201802": {"c": "TLL 530", "n": "Ottoman Turkish II", "f": "SL", "cr": 3.0, "ac": 5, "ca": 5, "pr": ["TLL 510", "TLL 510", "TLL 501", "TLL 501"], "co": ["TLL 530D"], "i": [{"tn": "Bahadır Sürelli", "ta": 5, "tc": 5}], "ce": 1, "p": 409}, "201901": {"c": "TLL 530", "n": "Ottoman Turkish II", "f": "SL", "cr": 3.0, "ac": 4, "ca": 10, "pr": ["TLL 510", "TLL 510", "TLL 501", "TLL 501"], "co": ["TLL 530D"], "i": [{"tn": "Bahadır Sürelli", "ta": 4, "tc": 10}], "ce": 1, "p": 434}, "202001": {"c": "TLL 530", "n": "Ottoman Turkish II", "f": "SL", "cr": 3.0, "ac": 4, "ca": 13, "pr": ["TLL 510", "TLL 510", "TLL 501", "TLL 501"], "co": ["TLL 530D"], "i": [{"tn": "Bahadır Sürelli", "ta": 4, "tc": 13}], "ce": 1, "p": 449}, "catList": ["This course is intended to enable students to attain basic proficiency in reading handwritten primary sources. It assumes that the student has already been introduced to the main calligraphic styles and genres of Ottoman Turkish. We will spend most of our time on official documents, but we shall also be looking at prose narratives. The archival documents dimension will be organized according to the three main calligraphic styles of rika, divani and talik. By types of documents, this section will comprise late 19th century berats and fermans as well as muhimme and shariyya records. The narrative dimension will be familiarizing students with the structure (as well as the specific jargon) of prose texts while also enhancing their self-confidence about their ability to read an entire work in Ottoman Turkish (such as Kâtip Çelebi's Mizan al-hakk or others)", "This course aims to introduce advanced grammar of Ottoman Turkish. The students participating in the course will first learn how to read major Ottoman printed materials. Therefore, it is aimed that the participants will be able to deal with different types of Ottoman sources, and especially with historical texts. Another important aspect of this course is to familiarize the students with the use of dictionaries to solve problems encountered in the assigned texts, and widening their perspectives on the variety of Ottoman texts and Ottoman printing culture. There will be weekly reading assessments and in-class exercises."]}