{"200601": {"c": "OPIM 407", "n": "Data Mining and Knowledge Discovery", "f": "FASS", "cr": 3.0, "ac": 7, "ca": 30, "pr": ["MATH 203", "MATH 306"], "co": [], "i": [{"tn": "Enes Eryarsoy", "ta": 7, "tc": 30}], "ce": 0, "p": 272}, "200701": {"c": "OPIM 407", "n": "Data Mining and Knowledge Discovery", "f": "FASS", "cr": 3.0, "ac": 15, "ca": 30, "pr": ["MATH 203"], "co": [], "i": [{"tn": "Enes Eryarsoy", "ta": 15, "tc": 30}], "ce": 1, "p": 174}, "200901": {"c": "OPIM 407", "n": "Business Inteligence and Decision Support Systems", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 30, "pr": ["MATH 203"], "co": [], "i": [{"tn": "Dursun Delen", "ta": 9, "tc": 30}], "ce": 2, "p": 278}, "201002": {"c": "OPIM 407", "n": "Business Inteligence and Decision Support Systems", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 40, "pr": ["MATH 203"], "co": [], "i": [{"tn": "Enes Eryarsoy", "ta": 6, "tc": 40}], "ce": 2, "p": 307}, "202001": {"c": "OPIM 407", "n": "Advanced Business Analytics", "f": "SOM", "cr": 3.0, "ac": 23, "ca": 50, "pr": ["OPIM 390"], "co": [], "i": [{"tn": "Mehmet Erdal Balaban", "ta": 23, "tc": 50}], "ce": 3, "p": 213}, "catList": ["During the last few years, our ability to process data as well as \"information glut\" has increased exponentially. Data mining (also known as knowledge discovery) is the process of analyzing data to identify not-so-obvious patterns and/or relationships by automatically searching large stores of data. The purpose of this course is to introduce the student to various data mining concepts, algorithms, and  their applications to real-world problems. A useful data analysis software will be introduced. Upon successful completion of this course students will be able to identify promising data mining applications, participate in data mining projects.", "during the last few years, our ability to process data as well as \"information glut\" has increased exponentially. Data mining (also known as knowledge discovery) is the process of analyzing data to identify not-so-obvious patterns and/or relationships by automatically searching large stores of data. The purpose of this course is to introduce the student to various data mining concept, algorithms and their applications to real-world business problems. A useful data analysis software will be introduced. Upon succesful completion of this course students will be able to identify promising data mining applications and participate in data mining projects.", "The main objective of this course is for the student to develop an understanding of the role of computer based information systems in direct support of managerial decision making (nowadays commonly referred as business intelligence). Specifically, at the end of this course each student should develop: a)  Knowledge about managerial decision making, business intelligence, decision support systems and how they relate to other types of information systems. b) Knowledge about DSSdevelopment methodologies and enabling technologies (such as Analytical Hierarchy Processes, Group Support Systems, Expert Systems, Neural Networks, Knowledge Management, Data Warehousing and Data Mining) c) Knowledge about DSS enabling software packages -a general understanding and some hands-on capabilities.", "The main objective of this course is to present predictive and prescriptive analytics tools in the context of business cases, with an emphasis on implementing analytical approaches within an organization. Throughout this course, students will learn: use tools and ideas from Analytics and R’s environment to solve interesting and exciting business problems; learn how to formulate relevant business questions that can be answered using data; understand the various steps of data preparation like data cleaning and feature extraction; develop and test hypotheses to inform managerial decisions and to collaborate meaningfully with multiple stakeholders; evaluate the effectiveness of a solution through statistical learning methods (supervised & unsupervised methods); communicate results to both technical and non-technical audiences."]}