{"199901": {"c": "GSM 511", "n": "Practice Development I", "f": "SOM", "cr": 0.0, "ac": 34, "ca": 50, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 34, "tc": 50}], "ce": 0, "p": 12}, "200001": {"c": "GSM 511", "n": "Practice Development I", "f": "SOM", "cr": 0.0, "ac": 34, "ca": 50, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 34, "tc": 50}], "ce": 0, "p": 17}, "200101": {"c": "GSM 511", "n": "Practice Development I", "f": "SOM", "cr": 0.0, "ac": 20, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 20, "tc": 25}], "ce": 0, "p": 33}, "200201": {"c": "GSM 511", "n": "Practice Development I", "f": "SOM", "cr": 0.0, "ac": 14, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 14, "tc": 25}], "ce": 1, "p": 84}, "200301": {"c": "GSM 511", "n": "Practice Development I", "f": "SOM", "cr": 0.0, "ac": 15, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Oğuz Babüroğlu", "ta": 15, "tc": 25}], "ce": 1, "p": 108}, "catList": ["", "Practice development is the capstone subject of the MBA program and continues for the entire first year and evolves into actual project work in the second year. The primary objective is to enable participants to develop the capability to function practically in real-life organisational settings through practice-driven foundations of management. Practice Development I lays the foundations of practice with a future management perspective that focuses on the emerging management paradigm as opposed to the prevailing conventional approach. The reflective action research paradigm will serve as the underpinning of the emerging paradigm. The course also assumes that in order to develop practice the manager has to be a reflective practitioner. Throughout the semester managers-in-practice are invited to engage in a dialogue to investigate the nature of their practice. Most typically, a chief executive officer, a general manager a project manager and a board member are invited to share their experience. Based on such interactions, the building blocks of Practice Development I manager-in-practice, practicing manager's job, managerial functions, competencies, and profile are constructed."]}