{"200202": {"c": "HIST 494", "n": "Recent Turkish Politics and Social History: Impressions and Inferences from Memoirs", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Selçuk Akşin Somel", "ta": 4, "tc": 20}], "ce": 0, "p": 189}, "200903": {"c": "HIST 494", "n": "Recent Turkish Political and Social History : Impressions and Inferences from Memoirs", "f": "FASS", "cr": 3.0, "ac": 7, "ca": 20, "pr": ["SPS 101", "SPS 102"], "co": [], "i": [{"tn": "Doğan Gürpınar", "ta": 7, "tc": 20}], "ce": 1, "p": 68}, "catList": ["This course is intended for all sophomore-, junior- and senior-level students interested in Ottoman everyday life of nineteenth and early twentieth centuries. It aims to introduce and discuss Ottoman socio-economic history on the basis of memoirs. After elaborating methodological benefits and shortcomings of memoirs as a historical source, participants will have the opportunity to encounter concrete personalities and characters, their lifestyle, personal actions and drama as a part of late Ottoman history. Thus a glimpse will be provided into the recent past in terms of the complex relationship between concrete human action and impersonal historical circumstances. This course covers childhood experiences, school impressions, social conditions of 19th century Ottoman women, commercial life, literary-artistic activities, journalistic experiences and everyday life of bureaucrats. Each of these issues will be treated within the context of Ottoman socio-political history.", "This course is intended for all sophomores, juniors and seniors interested in the Ottoman everyday life of the 19th and early 20th centuries. It aims to introduce and discuss Ottoman socio-economic history on the basis of memoirs. After setting out the methodological uses and shortcomings of memoirs as a historical source, participants will have the opportunity to encounter concrete personalities and characters, their lifestyle, personal actions and drama as a part of late Ottoman history. Thus a glimpse will be provided into the recent past in terms of the complex relationship between concrete human action and impersonal historical circumstances. This course covers childhood experiences, school impressions,  the social conditions of 19th century Ottoman women, commercial life, literary-artistic activities, journalistic experiences, and the everyday life of bureaucrats. Each of these issues will be treated within the context of Ottoman political and social history."]}