{"200002": {"c": "POLS 254", "n": "Turkish State Structure", "f": "FASS", "cr": 3.0, "ac": 6, "ca": 25, "pr": [], "co": [], "i": [{"tn": "Firuz Demir Yaşamış", "ta": 6, "tc": 25}], "ce": 0, "p": 55}, "200102": {"c": "POLS 254", "n": "Turkish State Structure", "f": "FASS", "cr": 3.0, "ac": 9, "ca": 40, "pr": [], "co": [], "i": [{"tn": "Firuz Demir Yaşamış", "ta": 9, "tc": 40}], "ce": 0, "p": 82}, "200202": {"c": "POLS 254", "n": "Turkish State Structure", "f": "FASS", "cr": 3.0, "ac": 15, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Firuz Demir Yaşamış", "ta": 15, "tc": 30}], "ce": 0, "p": 87}, "200302": {"c": "POLS 254", "n": "Turkish State Structure", "f": "FASS", "cr": 3.0, "ac": 13, "ca": 35, "pr": [], "co": [], "i": [{"tn": "Firuz Demir Yaşamış", "ta": 13, "tc": 35}], "ce": 0, "p": 116}, "catList": ["This course is aiming at providing a complete outlook of Turkish State structure and the overall conditions of Turkish democracy. The course is designed to provide introductory and basic information on how the Turkish State is structured and operating. The course will also empower the participants with necessary knowledge and information to enable them to comprehend, to appraise and to assess the democratic institutions/processes of Turkey. A special emphasis will be given to improvement of democratic conditions of the country. The course is targeted to those students who aspire to have BA degree in \"Social and Political Sciences Program\" (SPS) of the FASS of Sabanci University. In the course, the main principles of Turkish State and public administration will be explained and legislative, executive and judicial constituents of the Turkish State system as well as the Presidential component will be analysed. In addition to the central government bodies, the field organisation of the central government, spatial and service decentralisation institutions including local governments will also be dealt with. Organisational set up and administration/management of the national economy will also be analysed. The European Union enlargement procedures/conditions including the Copenhagen Criteria and their implications on the Turkish State structure and operations will also be evaluated."]}