{"200101": {"c": "POLS 383", "n": "Environmental Policies and Management", "f": "FASS", "cr": 3.0, "ac": 4, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Firuz Demir Yaşamış", "ta": 4, "tc": 30}], "ce": 0, "p": 127}, "200301": {"c": "POLS 383", "n": "Environmental Policies", "f": "FASS", "cr": 3.0, "ac": 5, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Firuz Demir Yaşamış", "ta": 5, "tc": 30}], "ce": 0, "p": 213}, "catList": ["As in the majority of the nations of this Globe, more and more environmental managers and policy makers are needed in Turkey who have been trained in dealing with the complexities of the analysis of environmental problems, pollution and environmental policy making. They are are supposed to operate effectively at the positions in governmental departments, private enterprises and non-governmental organisations. This course will aim at matching the need for academic specialist education who aspire to have a professional career in managerial and policy making position especially in international, national, central, regional and local governmental organisations as well as in private enterprises and in industry. The course will provide knowledge and insight that will play an important role in the development and evaluation of potential solutions for environmental problems to the participants. The overall target of this course will be the introduction of a spectrum of modern administrative, economic, financial, legal, management and institutional concepts, policies and management tools which are indispensable for environmental managers , engineers, experts of political sciences and experts of social sciences and public administrators whose range of duties includes environmental quality protection and enhancement tasks. The relations between human activities in society and the environment, the possibilities and restraints of technological solutions for environmental problems, the implementation and enforcement of policy instruments in theory and practice and methods used in policy design and policy evaluation will be mainly dealt with."]}