{"200501": {"c": "OPIM 523", "n": "Managerial Decision Making", "f": "SOM", "cr": 1.5, "ac": 9, "ca": 23, "pr": [], "co": [], "i": [{"tn": "Kerem Tomak", "ta": 9, "tc": 23}], "ce": 0, "p": 199}, "200702": {"c": "OPIM 523", "n": "Decision Models", "f": "SOM", "cr": 3.0, "ac": 4, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Çağrı Haksöz", "ta": 4, "tc": 20}], "ce": 1, "p": 335}, "200801": {"c": "OPIM 523", "n": "Decision Models", "f": "SOM", "cr": 3.0, "ac": 7, "ca": 20, "pr": [], "co": [], "i": [{"tn": "Çağrı Haksöz", "ta": 7, "tc": 20}], "ce": 1, "p": 286}, "200901": {"c": "OPIM 523", "n": "Decision Models", "f": "SOM", "cr": 3.0, "ac": 3, "ca": 15, "pr": [], "co": [], "i": [{"tn": "Çağrı Haksöz", "ta": 3, "tc": 15}], "ce": 1, "p": 411}, "201201": {"c": "OPIM 523", "n": "Decision Models", "f": "SOM", "cr": 3.0, "ac": 7, "ca": 10, "pr": [], "co": [], "i": [{"tn": "Çağrı Haksöz", "ta": 7, "tc": 10}], "ce": 1, "p": 353}, "201301": {"c": "OPIM 523", "n": "Decision Models", "f": "SOM", "cr": 3.0, "ac": 10, "ca": 15, "pr": ["OPIM 402"], "co": [], "i": [{"tn": "Çağrı Haksöz", "ta": 10, "tc": 15}], "ce": 1, "p": 292}, "201401": {"c": "OPIM 523", "n": "Decision Models", "f": "SOM", "cr": 3.0, "ac": 5, "ca": 30, "pr": [], "co": [], "i": [{"tn": "Çağrı Haksöz", "ta": 5, "tc": 30}], "ce": 1, "p": 378}, "201601": {"c": "OPIM 523", "n": "Decision Models", "f": "SOM", "cr": 3.0, "ac": 16, "ca": 50, "pr": [], "co": [], "i": [{"tn": "Çağrı Haksöz", "ta": 16, "tc": 50}], "ce": 1, "p": 259}, "catList": ["Uncertainty, multiple objectives, and complexity make many decisions difficult. To cope with difficult decisions, managers must make effective use of various types of information that are available, for example past data, forecasts regarding future events, decision alternatives now and in the future, attitudes toward risk, tradeoffs among objectives, and predictions of competitors' actions. Sometimes it is important to seek additional information as well. The goal of the Managerial Decision Making course is study aspects of decision analysis in depth, using a variety of modeling methods. Assignments and classroom discussions will help students develop decision-analysis modeling skills by focusing on the development and evaluation of models for complex and sometimes poorly defined problems. We will also see how such models are used to support decision making in large organizations and consulting practice. Managerial Decision Making is intended for MBA students who are interested in using formal models to support decision making regardless of functional area.", "The main goal of this course is to present the basic principles and techniques of mathematical modeling that will aid managerial decisions. With case analyses, assignments, and classroom discussions, students will learn the assumptions, limitations and the effective use of the analytical methods such as optimization and Monte Carlo simulation. The focus will be on model formulation and interpretation of results, not on mathematical theory. This course is designed for Sabancı MBA students with an interest in formal decision modeling. Therefore, the emphasis is on models that are widely used in diverse industries regardless of the functional areas."]}